lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="TMR0">
         <name>TMR1</name>
         <baseAddress>0x40000400</baseAddress>
	 <interrupt>
	    <name>TMR1_EVT</name>
	    <value>12</value>
	    <description>Event</description>
	 </interrupt>
      </peripheral>
      <peripheral derivedFrom="TMR0">
         <name>TMR2</name>
         <baseAddress>0x40000800</baseAddress>
	 <interrupt>
	    <name>TMR2_EVT</name>
	    <value>40</value>
	    <description>Event</description>
	 </interrupt>
      </peripheral>
      <peripheral>
         <name>RTC0</name>
         <description>Real-Time Clock</description>
         <baseAddress>0x40001000</baseAddress>
         <groupName>RTC0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>RTC0_EVT</name>
	    <value>8</value>
	    <description>RTC0 Event</description>
	 </interrupt>
         <registers>
            <register>
               <name>CR0</name>
               <addressOffset>0x00000000</addressOffset>
               <size>16</size>
               <description>RTC Control 0</description>
               <resetValue>0x000003C4</resetValue>
               <fields>
                  <field>
                     <name>CNTEN</name>
                     <description>Global enable for the RTC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ALMEN</name>
                     <description>Enable the RTC alarm (absolute) operation</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ALMINTEN</name>
                     <description>Enable sourced alarm interrupts to the CPU</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TRMEN</name>
                     <description>Enable RTC digital trimming</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MOD60ALMEN</name>
                     <description>Enable RTC modulo-60 counting of time past a modulo-60 boundary</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MOD60ALM</name>
                     <description>Periodic, modulo-60 alarm time in prescaled RTC time units beyond a modulo-60 boundary</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Example_1_Thirty_time_units_decimal</name>
                           <description>Example of setting a modulo-60 periodic interrupt from the RTC to be issued to the CPU at 30 time units past a modulo-60 boundary.</description>
                           <value>30</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Example_2_FiftyFive_time_units_decimal</name>
                           <description>Example of setting a modulo-60 periodic interrupt from the RTC to be issued to the CPU at 55 time units past a modulo-60 boundary.</description>
                           <value>55</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MOD60ALMINTEN</name>
                     <description>Enable periodic Modulo-60 RTC alarm sourced interrupts to the CPU</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ISOINTEN</name>
                     <description>Enable RTC power-domain isolation sourced interrupts to the CPU when isolation of the RTC power domain is activated and subsequently de-activated</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WPNDERRINTEN</name>
                     <description>Enable Write pending error sourced interrupts to the CPU when an RTC register-write pending error occurs</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WSYNCINTEN</name>
                     <description>Enable Write synchronization sourced interrupts to the CPU</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WPNDINTEN</name>
                     <description>Enable Write Pending sourced interrupts to the CPU</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR0</name>
               <addressOffset>0x00000004</addressOffset>
               <size>16</size>
               <description>RTC Status 0</description>
               <resetValue>0x00003F80</resetValue>
               <fields>
                  <field>
                     <name>ALMINT</name>
                     <description>Alarm interrupt source</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MOD60ALMINT</name>
                     <description>Modulo-60 RTC alarm interrupt source</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ISOINT</name>
                     <description>RTC power-domain isolation interrupt source</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WPNDERRINT</name>
                     <description>Write pending error interrupt source</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WSYNCINT</name>
                     <description>Write synchronization interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WPNDINT</name>
                     <description>Write pending interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WSYNCCR0</name>
                     <description>Synchronization status of posted writes to RTC Control 0 Register</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCSR0</name>
                     <description>Synchronization status of posted clearances to interrupt sources in RTC Status 0 Register</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCNT0</name>
                     <description>Synchronization status of posted writes to RTC Count 0 Register</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCNT1</name>
                     <description>Synchronization status of posted writes to RTC Count 1 Register</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCALM0</name>
                     <description>Synchronization status of posted writes to RTC Alarm 0 Register</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCALM1</name>
                     <description>Synchronization status of posted writes to RTC Alarm 1 Register</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCTRM</name>
                     <description>Synchronization status of posted writes to RTC Trim Register</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ISOENB</name>
                     <description>Visibility status of 32 kHz sourced registers, taking account of power-domain isolation</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR1</name>
               <addressOffset>0x00000008</addressOffset>
               <size>16</size>
               <description>RTC Status 1</description>
               <resetValue>0x00000078</resetValue>
               <fields>
                  <field>
                     <name>WPNDCR0</name>
                     <description>Pending status of posted writes to RTC Control 0 Register</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPNDSR0</name>
                     <description>Pending status of posted clearances of interrupt sources in RTC Status 0 Register</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPNDCNT0</name>
                     <description>Pending status of posted writes to RTC Count 0 Register</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPNDCNT1</name>
                     <description>Pending status of posted writes to RTC Count 1 Register</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPNDALM0</name>
                     <description>Pending status of posted writes to RTC ALARM 0 Register</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPNDALM1</name>
                     <description>Pending status of posted writes to RTC ALARM 1 Register</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPNDTRM</name>
                     <description>Pending status of posted writes to RTC Trim Register</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNT0</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>16</size>
               <description>RTC Count 0</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Lower 16 prescaled (non-fractional) bits of the RTC real-time count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNT1</name>
               <addressOffset>0x00000010</addressOffset>
               <size>16</size>
               <description>RTC Count 1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Upper 16 prescaled (non-fractional) bits of the RTC real-time count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALM0</name>
               <addressOffset>0x00000014</addressOffset>
               <size>16</size>
               <description>RTC Alarm 0</description>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Lower 16 prescaled (that is, non-fractional) bits of the RTC alarm target time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALM1</name>
               <addressOffset>0x00000018</addressOffset>
               <size>16</size>
               <description>RTC Alarm 1</description>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Upper 16 prescaled (non-fractional) bits of the RTC alarm target time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRM</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>16</size>
               <description>RTC Trim</description>
               <resetValue>0x00000398</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Trim value in prescaled RTC time units to be added or subtracted from the RTC count at the end of a periodic interval selected by RTC Trim Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ADD</name>
                     <description>Trim Polarity</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IVL</name>
                     <description>Trim interval in prescaled RTC time units</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IVL2EXPMIN</name>
                     <description>Minimum power-of-two interval of prescaled RTC time units, which RTC Trim Register can select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GWY</name>
               <addressOffset>0x00000020</addressOffset>
               <size>16</size>
               <description>RTC Gateway</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWKEY</name>
                     <description>Software-keyed command issued by the CPU</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR1</name>
               <addressOffset>0x00000028</addressOffset>
               <size>16</size>
               <description>RTC Control 1</description>
               <resetValue>0x000001E0</resetValue>
               <fields>
                  <field>
                     <name>CNTINTEN</name>
                     <description>Enable for the RTC count interrupt source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PSINTEN</name>
                     <description>Enable for the prescaled, modulo-1 interrupt source</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCTRMINTEN</name>
                     <description>Enable for the RTC Trim interrupt source</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNTROLLINTEN</name>
                     <description>Enable for the RTC count roll-over interrupt source in RTC Status 2 Register</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNTMOD60ROLLINTEN</name>
                     <description>Enable for the RTC modulo-60 count roll-over interrupt source in RTC Status 2 Register</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PRESCALE2EXP</name>
                     <description>Prescale power of 2 division factor for the RTC base clock</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
