lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
            <register>
               <name>SR2</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>16</size>
               <description>RTC Status 2</description>
               <resetValue>0x0000C000</resetValue>
               <fields>
                  <field>
                     <name>CNTINT</name>
                     <description>RTC count interrupt source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PSINT</name>
                     <description>RTC prescaled, modulo-1 boundary interrupt source</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TRMINT</name>
                     <description>RTC Trim interrupt source</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNTROLLINT</name>
                     <description>RTC count roll-over interrupt source</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNTMOD60ROLLINT</name>
                     <description>RTC modulo-60 count roll-over interrupt source</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNTROLL</name>
                     <description>RTC count roll-over</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CNTMOD60ROLL</name>
                     <description>RTC count modulo-60 roll-over</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TRMBDYMIR</name>
                     <description>Mirror of the RTCTRMBDY field of RTC Modulo Register</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPNDCR1MIR</name>
                     <description>Pending status of posted writes to RTC Control 1 Register</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPNDALM2MIR</name>
                     <description>Pending status of posted writes to RTC Alarm 2 Register</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCR1MIR</name>
                     <description>Synchronization status of posted writes to RTC Control 1 Register</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCALM2MIR</name>
                     <description>Synchronization status of posted writes to RTC Alarm 2 Register</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SNAP0</name>
               <addressOffset>0x00000030</addressOffset>
               <size>16</size>
               <description>RTC Snapshot 0</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Constituent part of the 47-bit RTC Input Capture Channel 0, containing a sticky snapshot of  RTC Count 0 Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SNAP1</name>
               <addressOffset>0x00000034</addressOffset>
               <size>16</size>
               <description>RTC Snapshot 1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Constituent part of the 47-bit RTC Input Capture Channel 0, containing a sticky snapshot of  RTC Count 1 Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SNAP2</name>
               <addressOffset>0x00000038</addressOffset>
               <size>16</size>
               <description>RTC Snapshot 2</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Constituent part of the 47-bit RTC Input Capture Channel 0, containing a sticky snapshot of RTC Count 2 Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>MOD</name>
               <addressOffset>0x0000003C</addressOffset>
               <size>16</size>
               <description>RTC Modulo</description>
               <resetValue>0x00000040</resetValue>
               <fields>
                  <field>
                     <name>CNTMOD60</name>
                     <description>Modulo-60 value of prescaled  RTC Count 1 and RTC Count 0 Registers</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>INCR</name>
                     <description>Most recent increment value added to the RTC Count in RTC Count 1 and RTC Count 0 Registers</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TRMBDY</name>
                     <description>Trim boundary indicator that the most recent RTC count increment has coincided with trimming of the count value</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CNT0_4TOZERO</name>
                     <description>Mirror of RTC Count 0 Register [4:0]</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNT2</name>
               <addressOffset>0x00000040</addressOffset>
               <size>16</size>
               <description>RTC Count 2</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Fractional bits of the RTC real-time count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALM2</name>
               <addressOffset>0x00000044</addressOffset>
               <size>16</size>
               <description>RTC Alarm 2</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Fractional (non-prescaled) bits of the RTC alarm target time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00007FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR3</name>
               <addressOffset>0x00000048</addressOffset>
               <size>16</size>
               <description>RTC Status 3</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RTCIC0IRQ</name>
                     <description>Sticky Interrupt Source for the RTC Input Capture Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCIC2IRQ</name>
                     <description>Sticky Interrupt Source for the RTC Input Capture Channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCIC3IRQ</name>
                     <description>Sticky Interrupt Source for the RTC Input Capture Channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCIC4IRQ</name>
                     <description>Sticky Interrupt Source for the RTC Input Capture Channel 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ALMINTMIR</name>
                     <description>Read-only mirror of the ALMINT interrupt source in RTC Status 0 Register, acting as RTCOC0IRQ</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RTCOC1IRQ</name>
                     <description>Sticky Interrupt Source for Output Compare Channel 1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR2IC</name>
               <addressOffset>0x0000004C</addressOffset>
               <size>16</size>
               <description>RTC Control 2 for Configuring Input Capture Channels</description>
               <resetValue>0x000083A0</resetValue>
               <fields>
                  <field>
                     <name>RTCIC0EN</name>
                     <description>Enable for the RTC Input Capture Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCIC2EN</name>
                     <description>Enable for the RTC Input Capture Channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCIC3EN</name>
                     <description>Enable for the RTC Input Capture Channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCIC4EN</name>
                     <description>Enable for the RTC Input Capture Channel 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCIC0LH</name>
                     <description>Polarity of the active-going capture edge for the RTC Input Capture Channel 0</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCIC2LH</name>
                     <description>Polarity of the active-going capture edge for the RTC Input Capture Channel 2</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCIC3LH</name>
                     <description>Polarity of the active-going capture edge for the RTC Input Capture Channel 3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCIC4LH</name>
                     <description>Polarity of the active-going capture edge for the RTC Input Capture Channel 4</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCIC0IRQEN</name>
                     <description>Interrupt Enable for the RTC Input Capture Channel 0</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCIC2IRQEN</name>
                     <description>Interrupt Enable for the RTC Input Capture Channel 2</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCIC3IRQEN</name>
                     <description>Interrupt Enable for the RTC Input Capture Channel 3</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCIC4IRQEN</name>
                     <description>Interrupt Enable for the RTC Input Capture Channel 4</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCICOWUSEN</name>
                     <description>Enable Overwrite of Unread Snapshots for all RTC Input Capture Channels</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR3OC</name>
               <addressOffset>0x00000050</addressOffset>
               <size>16</size>
               <description>RTC Control 3 for Configuring Output Compare Channel</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RTCOC1EN</name>
                     <description>Enable for Output Compare Channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCOC1IRQEN</name>
                     <description>Interrupt Enable for Output Compare Channel 1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR4OC</name>
               <addressOffset>0x00000054</addressOffset>
               <size>16</size>
               <description>RTC Control 4 for Configuring Output Compare Channel</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RTCOC1MSKEN</name>
                     <description>Enable for thermometer-code masking of the Output Compare 1 Channel</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EN000</name>
                           <description>Do not apply a mask to the 16-bit Output Compare channel OC1.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN001</name>
                           <description>Apply a thermometer-decoded mask to the 16-bit Output Compare channel OC1 provided that channel is enabled via CR3OC:RTCOC1EN</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RTCOC1ARLEN</name>
                     <description>Enable for auto-reloading when output compare match occurs</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OCMSK</name>
               <addressOffset>0x00000058</addressOffset>
               <size>16</size>
               <description>RTC Masks for Output Compare Channel</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RTCOCMSK</name>
                     <description>Concatenation of thermometer-encoded masks for the 16-bit output compare channels</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>OC1ARL</name>
               <addressOffset>0x0000005C</addressOffset>
               <size>16</size>
               <description>RTC Auto-Reload for Output Compare Channel 1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RTCOC1ARL</name>
                     <description>Auto-reload value when output compare match occurs</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IC2</name>
               <addressOffset>0x00000064</addressOffset>
               <size>16</size>
               <description>RTC Input Capture Channel 2</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RTCIC2</name>
                     <description>RTC Input Capture Channel 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>IC3</name>
               <addressOffset>0x00000068</addressOffset>
               <size>16</size>
               <description>RTC Input Capture Channel 3</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RTCIC3</name>
                     <description>RTC Input Capture Channel 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>IC4</name>
               <addressOffset>0x0000006C</addressOffset>
               <size>16</size>
               <description>RTC Input Capture Channel 4</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RTCIC4</name>
                     <description>RTC Input Capture Channel 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
