lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
            <register>
               <name>OC1</name>
               <addressOffset>0x00000070</addressOffset>
               <size>16</size>
               <description>RTC Output Compare Channel 1</description>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>RTCOC1</name>
                     <description>RTC Output Compare 1 Channel. Scheduled alarm target time with optional auto-reload</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR4</name>
               <addressOffset>0x00000080</addressOffset>
               <size>16</size>
               <description>RTC Status 4</description>
               <resetValue>0x000077FF</resetValue>
               <fields>
                  <field>
                     <name>WSYNCSR3</name>
                     <description>Synchronization status of posted clearances to interrupt sources in RTC Status 3 Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCR2IC</name>
                     <description>Synchronization status of posted writes to RTC Control 2 for Configuring Input Capture Channels Register</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCR3OC</name>
                     <description>Synchronization status of posted writes to RTC Control 3 for Configuring Output Compare Channel Register</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCR4OC</name>
                     <description>Synchronization status of posted writes to RTC Control 4 for Configuring Output Compare Channel Register</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCOCMSK</name>
                     <description>Synchronization status of posted writes to RTC Masks for Output Compare Channel Register</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCOC1ARL</name>
                     <description>Synchronization status of posted writes to RTC Auto-Reload for Output Compare Channel 1 Register</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCOC1</name>
                     <description>Synchronization status of posted writes to RTC Output Compare Channel 1 Register</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RSYNCIC0</name>
                     <description>Synchronization status of posted reads of RTC Input Channel 0</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RSYNCIC2</name>
                     <description>Synchronization status of posted reads of RTC Input Channel 2</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RSYNCIC3</name>
                     <description>Synchronization status of posted reads of RTC Input Channel 3</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RSYNCIC4</name>
                     <description>Synchronization status of posted reads of RTC Input Channel 4</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR5</name>
               <addressOffset>0x00000084</addressOffset>
               <size>16</size>
               <description>RTC Status 5</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WPNDSR0</name>
                     <description>Pending status of posted clearances of interrupt sources in RTC Status 3 Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDCR2IC</name>
                     <description>Pending status of posted writes to RTC Control 2 for Configuring Input Capture Channels Register</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDCR3OC</name>
                     <description>Pending status of posted writes to RTC Control 3 for Configuring Output Compare Channel Register</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDCR4OC</name>
                     <description>Pending status of posted writes to RTC Control 4 for Configuring Output Compare Channel Register</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDOCMSK</name>
                     <description>Pending status of posted writes to RTC Masks for Output Compare Channel Register</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDOC1ARL</name>
                     <description>Pending status of posted writes to RTC Auto-Reload for Output Compare Channel 1 Register</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDOC1</name>
                     <description>Pending status of posted writes to Output Compare Channel 1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RPENDIC0</name>
                     <description>Pending status of posted reads of RTC Input Channel 0</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RPENDIC2</name>
                     <description>Pending status of posted reads of RTC Input Channel 2</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RPENDIC3</name>
                     <description>Pending status of posted reads of RTC Input Channel 3</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RPENDIC4</name>
                     <description>Pending status of posted reads of RTC Input Channel 4</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR6</name>
               <addressOffset>0x00000088</addressOffset>
               <size>16</size>
               <description>RTC Status 6</description>
               <resetValue>0x00007900</resetValue>
               <fields>
                  <field>
                     <name>RTCIC0UNR</name>
                     <description>Sticky unread status of the RTC Input Capture Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RTCIC2UNR</name>
                     <description>Sticky unread status of the RTC Input Capture Channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RTCIC3UNR</name>
                     <description>Sticky unread status of the RTC Input Capture Channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RTCIC4UNR</name>
                     <description>Sticky unread status of the RTC Input Capture Channel 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RTCIC0SNAP</name>
                     <description>Confirmation that RTC Snapshot 0, 1, 2 registers reflect the value of RTC Input Capture Channel 0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RTCFRZCNTPTR</name>
                     <description>Pointer for the triple-read sequence of the RTC Freeze Count MMR</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OC1TGT</name>
               <addressOffset>0x0000008C</addressOffset>
               <size>16</size>
               <description>RTC Output Compare Channel 1 Target</description>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>RTCOC1TGT</name>
                     <description>Current, cumulative target time for Output Compare Channel 1, taking account of any auto-reloading</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>FRZCNT</name>
               <addressOffset>0x00000090</addressOffset>
               <size>16</size>
               <description>RTC Freeze Count</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RTCFRZCNT</name>
                     <description>RTC Freeze Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
