lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
            <register>
               <name>SCTL</name>
               <addressOffset>0x00000028</addressOffset>
               <size>16</size>
               <description>Slave control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLVEN</name>
                     <description>Slave enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ADR10EN</name>
                     <description>Enabled 10-bit addressing</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>GCEN</name>
                     <description>General call enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>HGCEN</name>
                     <description>Hardware general call enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>GCSBCLR</name>
                     <description>General call status bit clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EARLYTXR</name>
                     <description>Early transmit request mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>NACK</name>
                     <description>NACK next communication</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IENSTOP</name>
                     <description>Stop condition detected interrupt enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IENSRX</name>
                     <description>Slave Receive request interrupt enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IENSTX</name>
                     <description>Slave Transmit request interrupt enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>STXDEC</name>
                     <description>Decrement Slave Tx FIFO status when a byte has been transmitted</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IENREPST</name>
                     <description>Repeated start interrupt enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SRXDMA</name>
                     <description>Enable slave Rx DMA request</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>STXDMA</name>
                     <description>Enable slave Tx DMA request</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSTAT</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>16</size>
               <description>Slave I2C Status/Error/IRQ</description>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>STXFSEREQ</name>
                     <description>Slave Tx FIFO Status or early request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>STXUNDR</name>
                     <description>Slave Transmit FIFO underflow</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STXREQ</name>
                     <description>When read is slave transmit request; when write is clear slave transmit interrupt bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SRXREQ</name>
                     <description>Slave Receive request</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SRXOVR</name>
                     <description>Slave Receive FIFO overflow</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NOACK</name>
                     <description>Ack not generated by the slave</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SBUSY</name>
                     <description>Slave busy</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>GCINT</name>
                     <description>General call interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>GCID</name>
                     <description>General ID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STOP</name>
                     <description>Stop after start and matching address</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>IDMAT</name>
                     <description>Device ID matched</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>REPSTART</name>
                     <description>Repeated start and matching address</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>START</name>
                     <description>Start and matching address</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRX</name>
               <addressOffset>0x00000030</addressOffset>
               <size>16</size>
               <description>Slave receive</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Slave receive register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>STX</name>
               <addressOffset>0x00000034</addressOffset>
               <size>16</size>
               <description>Slave transmit</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Slave transmit register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALT</name>
               <addressOffset>0x00000038</addressOffset>
               <size>16</size>
               <description>Hardware general call ID</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Slave Alt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID0</name>
               <addressOffset>0x0000003C</addressOffset>
               <size>16</size>
               <description>1st slave address device ID</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Slave device ID 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID1</name>
               <addressOffset>0x00000040</addressOffset>
               <size>16</size>
               <description>2nd slave address device ID</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Slave device ID 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID2</name>
               <addressOffset>0x00000044</addressOffset>
               <size>16</size>
               <description>3rd slave address device ID</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Slave device ID 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID3</name>
               <addressOffset>0x00000048</addressOffset>
               <size>16</size>
               <description>4th slave address device ID</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Slave device ID 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAT</name>
               <addressOffset>0x0000004C</addressOffset>
               <size>16</size>
               <description>Master and slave FIFO status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STXF</name>
                     <description>Slave transmit FIFO status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SRXF</name>
                     <description>Slave receive FIFO status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MTXF</name>
                     <description>Master transmit FIFO status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MRXF</name>
                     <description>Master receive FIFO status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SFLUSH</name>
                     <description>Flush the slave transmit FIFO</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MFLUSH</name>
                     <description>Flush the master transmit FIFO</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHCTL</name>
               <addressOffset>0x00000050</addressOffset>
               <size>16</size>
               <description>Shared control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RST</name>
                     <description>Reset START STOP detect circuit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>TCTL</name>
               <addressOffset>0x00000054</addressOffset>
               <size>16</size>
               <description>Timing Control Register</description>
               <resetValue>0x00000005</resetValue>
               <fields>
                  <field>
                     <name>THDATIN</name>
                     <description>Data In Hold Start</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>FILTEROFF</name>
                     <description>Input Filter Control</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
