lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
            <register>
               <name>ASTRETCH_SCL</name>
               <addressOffset>0x00000058</addressOffset>
               <size>16</size>
               <description>Automatic stretch SCL register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MST</name>
                     <description>master automatic stretch mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SLV</name>
                     <description>slave automatic stretch mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MSTTMO</name>
                     <description>master automatic stretch timeout</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SLVTMO</name>
                     <description>slave automatic stretch timeout</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SPI0</name>
         <description>Serial Peripheral Interface</description>
         <baseAddress>0x40004000</baseAddress>
         <groupName>SPI0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>SPI0_EVT</name>
	    <value>15</value>
	    <description>Event</description>
	 </interrupt>
         <registers>
            <register>
               <name>STAT</name>
               <addressOffset>0x00000000</addressOffset>
               <size>16</size>
               <description>Status</description>
               <resetValue>0x00000800</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>SPI Interrupt status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>XFRDONE</name>
                     <description>SPI transfer completion</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>SPI Tx FIFO empty interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXDONE</name>
                     <description>SPI Tx Done in read command mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXUNDR</name>
                     <description>SPI Tx FIFO underflow</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXIRQ</name>
                     <description>SPI Tx IRQ</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RXIRQ</name>
                     <description>SPI Rx IRQ</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RXOVR</name>
                     <description>SPI Rx FIFO overflow</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CS</name>
                     <description>CS Status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CSERR</name>
                     <description>Detected a CS error condition in slave mode</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CSFALL</name>
                     <description>Detected a falling edge on CS, in slave CON mode</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CSRISE</name>
                     <description>Detected a rising edge on CS, in slave CON mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RDY</name>
                     <description>Detected an edge on Ready indicator for flow-control</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX</name>
               <addressOffset>0x00000004</addressOffset>
               <size>16</size>
               <description>Receive</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BYTE1</name>
                     <description>8-bit receive buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BYTE2</name>
                     <description>8-bit receive buffer, used only in DMA modes</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>TX</name>
               <addressOffset>0x00000008</addressOffset>
               <size>16</size>
               <description>Transmit</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BYTE1</name>
                     <description>8-bit transmit buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>BYTE2</name>
                     <description>8-bit transmit buffer, used only in DMA modes</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIV</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>16</size>
               <description>SPI baud rate selection</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>SPI clock divider</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000003F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL</name>
               <addressOffset>0x00000010</addressOffset>
               <size>16</size>
               <description>SPI configuration 1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SPIEN</name>
                     <description>SPI enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MASEN</name>
                     <description>Master mode enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CPHA</name>
                     <description>Serial clock phase mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CPOL</name>
                     <description>Serial Clock Polarity</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WOM</name>
                     <description>SPI Wired Or mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSB</name>
                     <description>LSB first transfer enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TIM</name>
                     <description>SPI transfer and interrupt mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ZEN</name>
                     <description>Transmit zeros enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RXOF</name>
                     <description>RX overflow overwrite enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>OEN</name>
                     <description>Slave MISO output enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>LOOPBACK</name>
                     <description>Loopback enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CON</name>
                     <description>Continuous transfer enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RFLUSH</name>
                     <description>SPI Rx FIFO Flush enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TFLUSH</name>
                     <description>SPI Tx FIFO Flush enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CSRST</name>
                     <description>Reset Mode for CS Error bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEN</name>
               <addressOffset>0x00000014</addressOffset>
               <size>16</size>
               <description>SPI configuration 2</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IRQMODE</name>
                     <description>SPI IRQ mode bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CS</name>
                     <description>Enable interrupt on every CS edge in slave CON mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TXUNDR</name>
                     <description>Tx-underflow interrupt enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RXOVR</name>
                     <description>Rx-overflow interrupt enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RDY</name>
                     <description>Ready signal edge interrupt enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXDONE</name>
                     <description>SPI transmit done interrupt enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>XFRDONE</name>
                     <description>SPI transfer completion interrupt enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Tx-FIFO Empty interrupt enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNT</name>
               <addressOffset>0x00000018</addressOffset>
               <size>16</size>
               <description>Transfer byte count</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Transfer byte count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00003FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>FRAMECONT</name>
                     <description>Continue frame</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMA</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>16</size>
               <description>SPI DMA enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>Enable DMA for data transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TXEN</name>
                     <description>Enable transmit DMA request</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RXEN</name>
                     <description>Enable receive DMA request</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
