lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
            <register>
               <name>FIFO_STAT</name>
               <addressOffset>0x00000020</addressOffset>
               <size>16</size>
               <description>FIFO Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TX</name>
                     <description>SPI Tx FIFO status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RX</name>
                     <description>SPI Rx FIFO status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>RD_CTL</name>
               <addressOffset>0x00000024</addressOffset>
               <size>16</size>
               <description>Read Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMDEN</name>
                     <description>Read command enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OVERLAP</name>
                     <description>Tx/Rx Overlap mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXBYTES</name>
                     <description>Transmit byte count minus 1 for read command</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>THREEPIN</name>
                     <description>Three pin SPI mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLOW_CTL</name>
               <addressOffset>0x00000028</addressOffset>
               <size>16</size>
               <description>Flow Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>Flow control mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RDYPOL</name>
                     <description>Polarity of RDY/MISO line</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RDBURSTSZ</name>
                     <description>Read data burst size minus 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>WAIT_TMR</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>16</size>
               <description>Wait timer for flow control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Wait timer for flow-control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CS_CTL</name>
               <addressOffset>0x00000030</addressOffset>
               <size>16</size>
               <description>Chip-Select control for multi-slave connections</description>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>Chip-Select control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CS_OVERRIDE</name>
               <addressOffset>0x00000034</addressOffset>
               <size>16</size>
               <description>Chip-Select Override</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CTL</name>
                     <description>CS Override Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
