lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="SPI0">
         <name>SPI2</name>
         <baseAddress>0x40024000</baseAddress>
      </peripheral>
      <peripheral>
         <name>UART0</name>
         <description>Unknown</description>
         <baseAddress>0x40005000</baseAddress>
         <groupName>UART0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>UART_EVT</name>
	    <value>14</value>
	    <description>Event</description>
	 </interrupt>
         <registers>
            <register>
               <name>COMRX</name>
               <addressOffset>0x00000000</addressOffset>
               <size>16</size>
               <description>Receive Buffer Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RBR</name>
                     <description>Receive Buffer Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMTX</name>
               <addressOffset>0x00000000</addressOffset>
               <size>16</size>
               <description>Transmit Holding Register</description>
               <alternateRegister>COMRX</alternateRegister>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>THR</name>
                     <description>Transmit Holding Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMIEN</name>
               <addressOffset>0x00000004</addressOffset>
               <size>16</size>
               <description>Interrupt Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ERBFI</name>
                     <description>Receive buffer full interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ETBEI</name>
                     <description>Transmit buffer empty interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ELSI</name>
                     <description>Rx status interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EDSSI</name>
                     <description>Modem status interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EDMAT</name>
                     <description>DMA requests in transmit mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EDMAR</name>
                     <description>DMA requests in receive mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMIIR</name>
               <addressOffset>0x00000008</addressOffset>
               <size>16</size>
               <description>Interrupt ID</description>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>NIRQ</name>
                     <description>Interrupt flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STA</name>
                     <description>Interrupt status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>FEND</name>
                     <description>FIFO enabled</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMLCR</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>16</size>
               <description>Line Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WLS</name>
                     <description>Word Length Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>STOP</name>
                     <description>Stop Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PEN</name>
                     <description>Parity Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPS</name>
                     <description>Parity Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SP</name>
                     <description>Stick Parity</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BRK</name>
                     <description>Set Break</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMMCR</name>
               <addressOffset>0x00000010</addressOffset>
               <size>16</size>
               <description>Modem Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DTR</name>
                     <description>Data Terminal Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTS</name>
                     <description>Request to send</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OUT1</name>
                     <description>Output 1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OUT2</name>
                     <description>Output 2</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LOOPBACK</name>
                     <description>Loopback mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMLSR</name>
               <addressOffset>0x00000014</addressOffset>
               <size>16</size>
               <description>Line Status</description>
               <resetValue>0x00000060</resetValue>
               <fields>
                  <field>
                     <name>DR</name>
                     <description>Data Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>OE</name>
                     <description>Overrun Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PE</name>
                     <description>Parity Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>FE</name>
                     <description>Framing Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BI</name>
                     <description>Break Indicator</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>THRE</name>
                     <description>COMTX Empty</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TEMT</name>
                     <description>COMTX and Shift Register Empty Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>FIFOERR</name>
                     <description>data byte(s) in RX FIFO have either parity error, frame error or break indication. only used in 16550 mode; Read-clear if no more error in RX FIFO</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMMSR</name>
               <addressOffset>0x00000018</addressOffset>
               <size>16</size>
               <description>Modem Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DCTS</name>
                     <description>Delta CTS</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DDSR</name>
                     <description>Delta DSR</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TERI</name>
                     <description>Trailing Edge RI</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DDCD</name>
                     <description>Delta DCD</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CTS</name>
                     <description>Clear To Send</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DSR</name>
                     <description>Data Set Ready</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RI</name>
                     <description>Ring Indicator</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DCD</name>
                     <description>Data Carrier Detect</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMSCR</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>16</size>
               <description>Scratch buffer</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCR</name>
                     <description>Scratch</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMFCR</name>
               <addressOffset>0x00000020</addressOffset>
               <size>16</size>
               <description>FIFO Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FIFOEN</name>
                     <description>FIFO enable as to work in 16550 mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RFCLR</name>
                     <description>clear RX FIFO</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TFCLR</name>
                     <description>clear TX FIFO</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>FDMAMD</name>
                     <description>FIFO DMA mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>MODE0</name>
                           <description>in DMA mode 0, RX DMA request will be asserted whenever there&#39;s data in RBR or RX FIFO and de-assert whenever RBR or RX FIFO is empty; TX DMA request will be asserted whenever THR or TX FIFO is empty and de-assert whenever data written to</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE1</name>
                           <description>in DMA mode 1, RX DMA request will be asserted whenever RX FIFO trig level or time out reached and de-assert thereafter when RX FIFO is empty; TX DMA request will be asserted whenever TX FIFO is empty and de-assert thereafter when TX FIFO is completely filled up full;</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RFTRIG</name>
                     <description>RX FIFO Trig level</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMFBR</name>
               <addressOffset>0x00000024</addressOffset>
               <size>16</size>
               <description>Fractional Baud Rate</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIVN</name>
                     <description>Fractional baud rate N divide bits 0 to 2047.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000007FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>DIVM</name>
                     <description>Fractional baud rate M divide bits 1 to 3</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>FBEN</name>
                     <description>Fractional baud rate generator enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMDIV</name>
               <addressOffset>0x00000028</addressOffset>
               <size>16</size>
               <description>Baudrate divider</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIV</name>
                     <description>Baud rate divider</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMLCR2</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>16</size>
               <description>second Line Control</description>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>OSR</name>
                     <description>Over Sample Rate</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
