lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
            <register>
               <name>COMCTL</name>
               <addressOffset>0x00000030</addressOffset>
               <size>16</size>
               <description>UART control register</description>
               <resetValue>0x00000100</resetValue>
               <fields>
                  <field>
                     <name>ForceClkOn</name>
                     <description>Force UCLKg on</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RXINV</name>
                     <description>invert receiver line</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EN000</name>
                           <description>don&#39;t invert receiver line (idling high)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN001</name>
                           <description>invert receiver line (idling low)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>REV</name>
                     <description>UART revision ID</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMRFC</name>
               <addressOffset>0x00000034</addressOffset>
               <size>16</size>
               <description>RX FIFO byte count</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RFC</name>
                     <description>Current RX FIFO data bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMTFC</name>
               <addressOffset>0x00000038</addressOffset>
               <size>16</size>
               <description>TX FIFO byte count</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TFC</name>
                     <description>Current TX FIFO data bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMRSC</name>
               <addressOffset>0x0000003C</addressOffset>
               <size>16</size>
               <description>RS485 half-duplex Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OENP</name>
                     <description>SOUT_EN polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OENSP</name>
                     <description>SOUT_EN de-assert before full stop bit(s)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DISRX</name>
                     <description>disable RX when transmitting</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>DISTX</name>
                     <description>Hold off TX when receiving</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMACR</name>
               <addressOffset>0x00000040</addressOffset>
               <size>16</size>
               <description>Auto Baud Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ABE</name>
                     <description>Auto Baud enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>DNIEN</name>
                     <description>enable done interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TOIEN</name>
                     <description>enable time-out interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SEC</name>
                     <description>Starting Edge Count</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EEC</name>
                     <description>Ending Edge Count</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMASRL</name>
               <addressOffset>0x00000044</addressOffset>
               <size>16</size>
               <description>Auto Baud Status (Low)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>Auto Baud Done successfully</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BRKTO</name>
                     <description>Timed out due to long time break condition</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NSETO</name>
                     <description>Timed out due to no valid start edge found</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NEETO</name>
                     <description>Timed out due to no valid ending edge found</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CNT</name>
                     <description>CNT[11:0]  Auto Baud Counter value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMASRH</name>
               <addressOffset>0x00000048</addressOffset>
               <size>16</size>
               <description>Auto Baud Status (High)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>CNT[19:12]  Auto Baud Counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
