lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DMA0</name>
         <description>DMA</description>
         <baseAddress>0x40010000</baseAddress>
         <groupName>DMA0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00001000</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>DMA_CHAN_ERR</name>
	    <value>19</value>
	    <description>DMA Error</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH0_DONE</name>
	    <value>20</value>
	    <description>Channel SPI1_TX Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH1_DONE</name>
	    <value>21</value>
	    <description>Channel SPI1_RX Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH2_DONE</name>
	    <value>22</value>
	    <description>Channel 2 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH3_DONE</name>
	    <value>23</value>
	    <description>Channel 3 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH4_DONE</name>
	    <value>24</value>
	    <description>Channel SPI0_TX Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH5_DONE</name>
	    <value>25</value>
	    <description>Channel SPI0_RX Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH6_DONE</name>
	    <value>26</value>
	    <description>Channel 6 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH7_DONE</name>
	    <value>27</value>
	    <description>Channel 7 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH8_DONE</name>
	    <value>28</value>
	    <description>Channel UART_TX Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH9_DONE</name>
	    <value>29</value>
	    <description>Channel UART_RX Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH10_DONE</name>
	    <value>30</value>
	    <description>Channel I2C0_STX Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH11_DONE</name>
	    <value>31</value>
	    <description>Channel I2C0_SRX Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH12_DONE</name>
	    <value>32</value>
	    <description>Channel I2C0_MX Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH13_DONE</name>
	    <value>33</value>
	    <description>Channel AES_IN_Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH14_DONE</name>
	    <value>34</value>
	    <description>Channel AES_OUT_Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH15_DONE</name>
	    <value>35</value>
	    <description>Channel FLASH0_Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH16_DONE</name>
	    <value>56</value>
	    <description>AFE_DMA_CMDFIFO</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH17_DONE</name>
	    <value>57</value>
	    <description>AFE_DMA_DATAFIFO</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH18_DONE</name>
	    <value>58</value>
	    <description>Channel 18 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH19_DONE</name>
	    <value>59</value>
	    <description>Channel 19 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH20_DONE</name>
	    <value>60</value>
	    <description>Channel 20 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH21_DONE</name>
	    <value>61</value>
	    <description>Channel 21 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH22_DONE</name>
	    <value>62</value>
	    <description>Channel 22 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH23_DONE</name>
	    <value>63</value>
	    <description>Channel 23 Done</description>
	 </interrupt>
         <registers>
            <register>
               <name>STAT</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>DMA Status</description>
               <resetValue>0x00180000</resetValue>
               <fields>
                  <field>
                     <name>MEN</name>
                     <description>Enable status of the controller</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CHANM1</name>
                     <description>Number of available DMA channels minus 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFG</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>DMA Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MEN</name>
                     <description>Controller enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDBPTR</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>DMA channel primary control data base pointer</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Pointer to the base address of the primary data structure</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADBPTR</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>DMA channel alternate control data base pointer</description>
               <resetValue>0x00000200</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Base address of the alternate data structure</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWREQ</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <description>DMA channel software request</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Generate software request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>RMSK_SET</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size>
               <description>DMA channel request mask set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Mask requests from DMA channels</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>RMSK_CLR</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size>
               <description>DMA channel request mask clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Clear Request Mask Set bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>EN_SET</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size>
               <description>DMA channel enable set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Enable DMA channels</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>EN_CLR</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>32</size>
               <description>DMA channel enable clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Disable DMA channels</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALT_SET</name>
               <addressOffset>0x00000030</addressOffset>
               <size>32</size>
               <description>DMA channel primary-alternate set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Control struct status / select alt struct</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALT_CLR</name>
               <addressOffset>0x00000034</addressOffset>
               <size>32</size>
               <description>DMA channel primary-alternate clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Select primary data struct</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRI_SET</name>
               <addressOffset>0x00000038</addressOffset>
               <size>32</size>
               <description>DMA channel priority set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Configure channel for high priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRI_CLR</name>
               <addressOffset>0x0000003C</addressOffset>
               <size>32</size>
               <description>DMA channel priority clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHPRICLR</name>
                     <description>Configure channel for default priority level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ERRCHNL_CLR</name>
               <addressOffset>0x00000048</addressOffset>
               <size>32</size>
               <description>DMA Per Channel Error Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Per channel Bus error status/ Per channel bus error clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ERR_CLR</name>
               <addressOffset>0x0000004C</addressOffset>
               <size>32</size>
               <description>DMA bus error clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Bus error status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>INVALIDDESC_CLR</name>
               <addressOffset>0x00000050</addressOffset>
               <size>32</size>
               <description>DMA Per Channel Invalid Descriptor Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Per channel Invalid Descriptor status/ Per channel Invalid descriptor status clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>BS_SET</name>
               <addressOffset>0x00000800</addressOffset>
               <size>32</size>
               <description>DMA channel bytes swap enable set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Byte swap status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>BS_CLR</name>
               <addressOffset>0x00000804</addressOffset>
               <size>32</size>
               <description>DMA channel bytes swap enable clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Disable byte swap</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRCADDR_SET</name>
               <addressOffset>0x00000810</addressOffset>
               <size>32</size>
               <description>DMA channel source address decrement enable set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Source Address decrement status / configure Source address decrement</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRCADDR_CLR</name>
               <addressOffset>0x00000814</addressOffset>
               <size>32</size>
               <description>DMA channel source address decrement enable clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Disable source address decrement</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSTADDR_SET</name>
               <addressOffset>0x00000818</addressOffset>
               <size>32</size>
               <description>DMA channel destination address decrement enable set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Destination Address decrement status / configure destination address decrement</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSTADDR_CLR</name>
               <addressOffset>0x0000081C</addressOffset>
               <size>32</size>
               <description>DMA channel destination address decrement enable clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Disable destination address decrement</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
