lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
            <register>
               <name>TIME_PARAM0</name>
               <addressOffset>0x00000034</addressOffset>
               <size>32</size>
               <description>Time Parameter 0</description>
               <resetValue>0xB8955950</resetValue>
               <fields>
                  <field>
                     <name>DIVREFCLK</name>
                     <description>Divide Reference Clock (by 2)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TNVS</name>
                     <description>PROG/ERASE to NVSTR setup time</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TPGS</name>
                     <description>NVSTR to Program setup time</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TPROG</name>
                     <description>Program time</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TNVH</name>
                     <description>NVSTR Hold time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TRCV</name>
                     <description>Recovery time</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TERASE</name>
                     <description>Erase Time</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TNVH1</name>
                     <description>NVSTR Hold time during Mass Erase</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIME_PARAM1</name>
               <addressOffset>0x00000038</addressOffset>
               <size>32</size>
               <description>Time parameter 1</description>
               <resetValue>0x00000004</resetValue>
               <fields>
                  <field>
                     <name>TWK</name>
                     <description>Wake up time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ABORT_EN_LO</name>
               <addressOffset>0x0000003C</addressOffset>
               <size>32</size>
               <description>IRQ Abort Enable (lower bits)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE[31:0]  Sys IRQ abort enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ABORT_EN_HI</name>
               <addressOffset>0x00000040</addressOffset>
               <size>32</size>
               <description>IRQ Abort Enable (upper bits)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE[63:32]  Sys IRQ abort enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECC_CFG</name>
               <addressOffset>0x00000044</addressOffset>
               <size>32</size>
               <description>ECC Config</description>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>ECC Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>INFOEN</name>
                     <description>Info space ECC Enable bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PTR</name>
                     <description>ECC start page pointer (user should write bits [31:8] of the start page address into bits [31:8] of this register)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECC_ADDR</name>
               <addressOffset>0x00000048</addressOffset>
               <size>32</size>
               <description>ECC Status (Address)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>This register has the address for which ECC error is detected</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADI_POR_SEC</name>
               <addressOffset>0x00000050</addressOffset>
               <size>32</size>
               <description>ADI flash security</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SECURE</name>
                     <description>Set this bit to prevent read or write access to User Space (sticky when set)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
