lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
            <register>
               <name>DS</name>
               <addressOffset>0x00000034</addressOffset>
               <size>16</size>
               <description>Port Drive Strength Select</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Drive strength select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="GPIO0">
         <name>GPIO1</name>
         <baseAddress>0x40020040</baseAddress>
      </peripheral>
      <peripheral derivedFrom="GPIO0">
         <name>GPIO2</name>
         <baseAddress>0x40020080</baseAddress>
      </peripheral>
      <peripheral>
         <name>CRC0</name>
         <description>CRC Accelerator</description>
         <baseAddress>0x40040000</baseAddress>
         <groupName>CRC0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTL</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>CRC Control Register</description>
               <resetValue>0x10000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>CRC Peripheral Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSBFIRST</name>
                     <description>LSB First Calculation Order</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BITMIRR</name>
                     <description>Bit Mirroring</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BYTMIRR</name>
                     <description>Byte Mirroring</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>W16SWP</name>
                     <description>Word16 Swap</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RevID</name>
                     <description>Revision ID</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPDATA</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Input Data Word Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Data Input.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>RESULT</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>CRC Result Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CRC Residue</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>POLY</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>Programmable CRC Polynomial</description>
               <resetValue>0x04C11DB7</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CRC Reduction Polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>1</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
               <name>IPBITS[%s]</name>
               <addressOffset>0x00000010</addressOffset>
               <size>8</size>
               <description>Input Data Bits</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA_BITS</name>
                     <description>Input Data Bits.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPBYTE</name>
               <addressOffset>0x00000010</addressOffset>
               <size>8</size>
               <description>Input Data Byte</description>
               <alternateRegister>IPBITS0</alternateRegister>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA_BYTE</name>
                     <description>Input Data Byte.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
