lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PMG0</name>
         <description>Power Management </description>
         <baseAddress>0x4004C000</baseAddress>
         <groupName>PMG0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00004000</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>PMG0_VREG_OVR</name>
	    <value>6</value>
	    <description>Voltage Regulator (VREG) Overvoltage</description>
	 </interrupt>
	 <interrupt>
	    <name>PMG0_BATT_RANGE</name>
	    <value>7</value>
	    <description>Battery Voltage (VBAT) Out of Range</description>
	 </interrupt>
         <registers>
            <register>
               <name>IEN</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>Power Supply Monitor Interrupt Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VBAT</name>
                     <description>Enable Interrupt for VBAT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>VREGUNDR</name>
                     <description>Enable Interrupt when VREG under-voltage: below 1V</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>VREGOVR</name>
                     <description>Enable Interrupt when VREG over-voltage: over- 1.32V</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RANGEBAT</name>
                     <description>Battery Monitor Range</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>region1</name>
                           <description>Configure to generate interrupt if VBAT &gt; 2.75V</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>region2</name>
                           <description>Configure to generate interrupt if VBAT between 2.75V - 1.6V</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>region3</name>
                           <description>Configure to generate interrupt if VBAT between 2.3V - 1.6V</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NA</name>
                           <description>N/A</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IENBAT</name>
                     <description>Interrupt enable for VBAT range</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PSM_STAT</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Power supply monitor status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VBATUNDR</name>
                     <description>Status bit indicating an Alarm that battery is below 1.8V.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>VREGUNDR</name>
                     <description>Status bit for Alarm indicating VREG is below 1V.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>VREGOVR</name>
                     <description>Status bit for alarm indicating Overvoltage for VREG</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>WICENACK</name>
                     <description>WIC Enable Acknowledge from Cortex</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RANGE1</name>
                     <description>VBAT range1 (&gt; 2.75v)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RANGE2</name>
                     <description>VBAT range2 (2.75v - 2.3v)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RANGE3</name>
                     <description>VBAT range3 (2.3v - 1.6v)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RORANGE1</name>
                     <description>VBAT range1 (&gt; 2.75v)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>batstat1</name>
                           <description>VBAT NOT in the range specified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>batstat0</name>
                           <description>VBAT in the range specified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RORANGE2</name>
                     <description>VBAT range2 (2.75v - 2.3v)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RORANGE3</name>
                     <description>VBAT range3 (2.3v - 1.6v)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWRMOD</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>Power Mode Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>Power Mode Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FLEXI</name>
                           <description>FLEXI Mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIBERNATE</name>
                           <description>HIBERNATE Mode</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHUTDOWN</name>
                           <description>SHUTDOWN Mode</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MONVBATN</name>
                     <description>Monitor VBAT during HIBERNATE Mode. Monitors VBAT by default</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWRKEY</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>Key protection for PWRMOD and  SRAMRET</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Power control key register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHDN_STAT</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>SHUTDOWN Status Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTINT0</name>
                     <description>Interrupt from External Interrupt 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EXTINT1</name>
                     <description>Interrupt from External Interrupt 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EXTINT2</name>
                     <description>Interrupt from External Interrupt 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RTC</name>
                     <description>Interrupt from RTC</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRAMRET</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <description>Control for Retention SRAM during HIBERNATE Mode</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BNK1EN</name>
                     <description>Enable retention bank 1 (8kB)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>BNK2EN</name>
                     <description>Enable retention bank 2 (16kB)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>RST_STAT</name>
               <addressOffset>0x00000040</addressOffset>
               <size>32</size>
               <description>Reset status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>POR</name>
                     <description>Power-on reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EXTRST</name>
                     <description>External reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>WDRST</name>
                     <description>Watchdog timeout</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SWRST</name>
                     <description>Software reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PORSRC</name>
                     <description>Power on reset Source (pmg_rst_src)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FAILSAFE_HV</name>
                           <description>POR triggered because VBAT drops below Fail Safe</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RST_VBAT</name>
                           <description>POR trigger because VBAT supply (VBAT&lt;1.7v)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RST_VREG</name>
                           <description>POR triggered because VDD supply (VDD &lt; 1.08v)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FAILSAFE_LV</name>
                           <description>POR triggered because VREG drops below Fail Safe</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL1</name>
               <addressOffset>0x00000044</addressOffset>
               <size>32</size>
               <description>HPBUCK control</description>
               <resetValue>0x00A00000</resetValue>
               <fields>
                  <field>
                     <name>HPBUCKEN</name>
                     <description>Enable HP Buck</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
