lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>XINT0</name>
         <description>External interrupt configuration</description>
         <baseAddress>0x4004C080</baseAddress>
         <groupName>XINT0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00004000</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>XINT_EVT1</name>
	    <value>2</value>
	    <description>External Wakeup Interrupt n</description>
	 </interrupt>
	 <interrupt>
	    <name>AFE_EVT3</name>
	    <value>4</value>
	    <description>AFE Interrupt</description>
	 </interrupt>
         <registers>
            <register>
               <name>CFG0</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>External Interrupt Configuration</description>
               <resetValue>0x00200000</resetValue>
               <fields>
                  <field>
                     <name>IRQ0MDE</name>
                     <description>External Interrupt 0 Mode registers</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IRQ0EN</name>
                     <description>External Interrupt 0 Enable bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IRQ1MDE</name>
                     <description>External Interrupt 1 Mode registers</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IRQ1EN</name>
                     <description>External Interrupt 1 Enable bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IRQ2MDE</name>
                     <description>External Interrupt 2 Mode registers</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IRQ2EN</name>
                     <description>External Interrupt 2 Enable bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IRQ3MDE</name>
                     <description>External Interrupt 3 Mode registers</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IRQ3EN</name>
                     <description>External Interrupt 3 enable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>UART_RX_EN</name>
                     <description>External Interrupt enable bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>UART_RX_MDE</name>
                     <description>External Interrupt using UART_RX wakeup Mode registers</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXT_STAT</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>External Wakeup Interrupt Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STAT_EXTINT0</name>
                     <description>Interrupt status bit for External Interrupt 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STAT_EXTINT1</name>
                     <description>Interrupt status bit for External Interrupt 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STAT_EXTINT2</name>
                     <description>Interrupt status bit for External Interrupt 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STAT_EXTINT3</name>
                     <description>Interrupt status bit for External Interrupt 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STAT_UART_RXWKUP</name>
                     <description>Interrupt status bit for UART RX wakeup interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLR</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>External Interrupt Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IRQ0</name>
                     <description>External interrupt 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IRQ1</name>
                     <description>External interrupt 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IRQ2</name>
                     <description>External interrupt 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IRQ3</name>
                     <description>External interrupt 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>UART_RX_CLR</name>
                     <description>External interrupt Clear for UART_RX WAKEUP interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMICLR</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <description>Non-Maskable Interrupt Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLR</name>
                     <description>NMI clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
