lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CLKG0_OSC</name>
         <description>Clocking </description>
         <baseAddress>0x4004C100</baseAddress>
         <groupName>CLKG0_OSC</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00004000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>KEY</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>Key Protection for OSCCTRL</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Oscillator key</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>Oscillator Control</description>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>LFCLKMUX</name>
                     <description>32 KHz clock select mux</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HFOSCEN</name>
                     <description>High frequency internal oscillator enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFXTALEN</name>
                     <description>Low frequency crystal oscillator enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HFXTALEN</name>
                     <description>High frequency crystal oscillator enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFXTAL_BYPASS</name>
                     <description>Low frequency crystal oscillator Bypass</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFXTAL_MON_EN</name>
                     <description>LFXTAL clock monitor and Clock FAIL interrupt enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFOSCOK</name>
                     <description>Status of LFOSC oscillator</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HFOSCOK</name>
                     <description>Status of HFOSC oscillator</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LFXTALOK</name>
                     <description>Status of LFXTAL oscillator</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HFXTALOK</name>
                     <description>Status of HFXTAL oscillator</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LFXTAL_MON_FAIL_STAT</name>
                     <description>LF XTAL (crystal clock) Not Stable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>PMG0_TST</name>
         <description>Power Management </description>
         <baseAddress>0x4004C200</baseAddress>
         <groupName>PMG0_TST</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00004000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SRAM_CTL</name>
               <addressOffset>0x00000060</addressOffset>
               <size>32</size>
               <description>Control for SRAM parity and instruction SRAM</description>
               <resetValue>0x80000000</resetValue>
               <fields>
                  <field>
                     <name>BNK0EN</name>
                     <description>Enable initialization</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>BNK1EN</name>
                     <description>Enable initialization</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>BNK2EN</name>
                     <description>Enable initialization</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>BNK3EN</name>
                     <description>Enable initialization</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>BNK4EN</name>
                     <description>Enable initialization</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>BNK5EN</name>
                     <description>Enable initialization</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>STARTINIT</name>
                     <description>Write one to trigger initialization. Self-cleared</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>AUTOINIT</name>
                     <description>Automatic initialization on wake up from Hibernate mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ABTINIT</name>
                     <description>Abort current initialization. Self-cleared</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PENBNK0</name>
                     <description>Enable parity check</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PENBNK1</name>
                     <description>Enable parity check</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PENBNK2</name>
                     <description>Enable parity check</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PENBNK3</name>
                     <description>Enable parity check</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PENBNK4</name>
                     <description>Enable parity check</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PENBNK5</name>
                     <description>Enable parity check</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>INSTREN</name>
                     <description>Enables instruction SRAM</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRAM_INITSTAT</name>
               <addressOffset>0x00000064</addressOffset>
               <size>32</size>
               <description>Initialization Status Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BNK0</name>
                     <description>0:Not initialized; 1:Initialization completed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BNK1</name>
                     <description>0:Not initialized; 1:Initialization completed</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BNK2</name>
                     <description>0:Not initialized; 1:Initialization completed</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BNK3</name>
                     <description>0:Not initialized; 1:Initialization completed</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BNK4</name>
                     <description>0:Not initialized; 1:Initialization completed</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BNK5</name>
                     <description>0:Not initialized; 1:Initialization completed</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLR_LATCH_GPIOS</name>
               <addressOffset>0x00000068</addressOffset>
               <size>16</size>
               <description>CLEAR GPIO AFTER SHUTDOWN MODE</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Writing 0x58FA creates a pulse to clear the latches for the GPIOs</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCRPAD_IMG</name>
               <addressOffset>0x0000006C</addressOffset>
               <size>32</size>
               <description>SCRATCH PAD IMAGE</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Anything written to this register will be saved in 3V when going to shutdown mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCRPAD_3V_RD</name>
               <addressOffset>0x00000070</addressOffset>
               <size>32</size>
               <description>SCRATCH PAD SAVED IN BATTERY DOMAIN</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Read Only register. Reading the scratch pad stored in shutdown mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
