lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CLKG0_CLK</name>
         <description>Clocking </description>
         <baseAddress>0x4004C300</baseAddress>
         <groupName>CLKG0_CLK</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00004000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTL0</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>Misc clock settings</description>
               <resetValue>0x00000078</resetValue>
               <fields>
                  <field>
                     <name>CLKMUX</name>
                     <description>Clock mux select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RCLKMUX</name>
                     <description>Flash reference clock and HPBUCK clock source mux</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SPLLIPSEL</name>
                     <description>SPLL source select mux</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFXTALIE</name>
                     <description>Low frequency crystal interrupt enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HFXTALIE</name>
                     <description>High frequency crystal interrupt enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL1</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Clock dividers</description>
               <resetValue>0x00100404</resetValue>
               <fields>
                  <field>
                     <name>HCLKDIVCNT</name>
                     <description>HCLK divide count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000003F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PCLKDIVCNT</name>
                     <description>PCLK divide count</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000003F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ACLKDIVCNT</name>
                     <description>ACLK Divide Count.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL3</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>System PLL</description>
               <resetValue>0x0000691A</resetValue>
               <fields>
                  <field>
                     <name>SPLLNSEL</name>
                     <description>System PLL N multiplier</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SPLLDIV2</name>
                     <description>System PLL division by 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SPLLEN</name>
                     <description>System PLL enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SPLLIE</name>
                     <description>System PLL interrupt enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SPLLMSEL</name>
                     <description>System PLL M Divider</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SPLLMUL2</name>
                     <description>system PLL multiply by 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL5</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <description>User clock gating control</description>
               <resetValue>0x0000001F</resetValue>
               <fields>
                  <field>
                     <name>GPTCLK0OFF</name>
                     <description>GP timer 0 user control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>GPTCLK1OFF</name>
                     <description>GP timer 1 user control</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>GPTCLK2OFF</name>
                     <description>GP timer 2 user control</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>UCLKI2COFF</name>
                     <description>I2C clock user control</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>GPIOCLKOFF</name>
                     <description>GPIO clock control</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PERCLKOFF</name>
                     <description>This bit is used to disable all clocks connected to all peripherals</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAT0</name>
               <addressOffset>0x00000018</addressOffset>
               <size>32</size>
               <description>Clocking status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SPLL</name>
                     <description>System PLL status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SPLLLK</name>
                     <description>System PLL lock</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SPLLUNLK</name>
                     <description>System PLL unlock</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFXTAL</name>
                     <description>LF crystal status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LFXTALOK</name>
                     <description>LF crystal stable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFXTALNOK</name>
                     <description>LF crystal not stable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HFXTAL</name>
                     <description>HF crystal status</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HFXTALOK</name>
                     <description>HF crystal stable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HFXTALNOK</name>
                     <description>HF crystal not stable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
