lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>BUSM0</name>
         <description>Bus matrix</description>
         <baseAddress>0x4004C800</baseAddress>
         <groupName>BUSM0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00004000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>ARBIT0</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>Arbitration Priority Configuration for FLASH and SRAM0</description>
               <resetValue>0x00240024</resetValue>
               <fields>
                  <field>
                     <name>FLSH_DCODE</name>
                     <description>Flash priority for DCODE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>FLSH_SBUS</name>
                     <description>Flash priority for SBUS</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>FLSH_DMA0</name>
                     <description>Flash priority for DMA0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SRAM0_DCODE</name>
                     <description>SRAM0 priority for Dcode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SRAM0_SBUS</name>
                     <description>SRAM0 priority for SBUS</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SRAM0_DMA0</name>
                     <description>SRAM0 priority for DMA0</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ARBIT1</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Arbitration Priority Configuration for SRAM1 and SIP</description>
               <resetValue>0x00240024</resetValue>
               <fields>
                  <field>
                     <name>SRAM1_DCODE</name>
                     <description>SRAM1 priority for Dcode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SRAM1_SBUS</name>
                     <description>SRAM1 priority for SBUS</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SRAM1_DMA0</name>
                     <description>SRAM1 priority for DMA0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SIP_DCODE</name>
                     <description>SIP priority for DCODE</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SIP_SBUS</name>
                     <description>SIP priority for SBUS</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SIP_DMA0</name>
                     <description>SIP priority for DMA0</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ARBIT2</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>Arbitration Priority Configuration for APB32 and APB16</description>
               <resetValue>0x00240024</resetValue>
               <fields>
                  <field>
                     <name>APB32_DCODE</name>
                     <description>APB32 priority for DCODE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>APB32_SBUS</name>
                     <description>APB32 priority for SBUS</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>APB32_DMA0</name>
                     <description>APB32 priority for DMA0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>APB16_DCODE</name>
                     <description>APB16 priority for DCODE</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>APB16_SBUS</name>
                     <description>APB16 priority for SBUS</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>APB16_DMA0</name>
                     <description>APB16 priority for DMA0</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ARBIT3</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>Arbitration Priority Configuration for APB16 priority for core and for DMA1</description>
               <resetValue>0x00010002</resetValue>
               <fields>
                  <field>
                     <name>APB16_CORE</name>
                     <description>APB16 priority for CORE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>APB16_DMA1</name>
                     <description>APB16 priority for DMA1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>APB16_4DMA_CORE</name>
                     <description>APB16 for dma priority for CORE</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>APB16_4DMA_DMA1</name>
                     <description>APB16 for dma priority for DMA1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
