lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>AGPIO2</name>
         <description>Unknown</description>
         <baseAddress>0x400C0080</baseAddress>
         <groupName>AGPIO2</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000040</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CON</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>GPIO Port Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PIN0CFG</name>
                     <description>Pin 0 Configuration Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN1CFG</name>
                     <description>Pin 1 Configuration Bits</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN2CFG</name>
                     <description>Pin 2 Configuration Bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN3CFG</name>
                     <description>Pin 3 Configuration Bits</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN4CFG</name>
                     <description>Pin 4 Configuration Bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN5CFG</name>
                     <description>Pin 5 Configuration Bits</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN6CFG</name>
                     <description>Pin 6 Configuration Bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PIN7CFG</name>
                     <description>Pin 7 Configuration Bits</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>OEN</name>
               <addressOffset>0x00000004</addressOffset>
               <size>16</size>
               <description>GPIO Port Output Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OEN</name>
                     <description>Pin Output Drive enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PE</name>
               <addressOffset>0x00000008</addressOffset>
               <size>16</size>
               <description>GPIO Port Pullup/Pulldown Enable</description>
               <resetValue>0x000000C0</resetValue>
               <fields>
                  <field>
                     <name>PE</name>
                     <description>Pin Pull enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEN</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>16</size>
               <description>GPIO Port Input Path Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IEN</name>
                     <description>Input path enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IN</name>
               <addressOffset>0x00000010</addressOffset>
               <size>16</size>
               <description>GPIO Port Registered Data Input</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IN</name>
                     <description>Registered data input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OUT</name>
               <addressOffset>0x00000014</addressOffset>
               <size>16</size>
               <description>GPIO Port Data Output</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OUT</name>
                     <description>Data out</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SET</name>
               <addressOffset>0x00000018</addressOffset>
               <size>16</size>
               <description>GPIO Port Data Out Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SET</name>
                     <description>Set the output HIGH for the pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLR</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>16</size>
               <description>GPIO Port Data Out Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLR</name>
                     <description>Set the output low  for the port pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>TGL</name>
               <addressOffset>0x00000020</addressOffset>
               <size>16</size>
               <description>GPIO Port Pin Toggle</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TGL</name>
                     <description>Toggle the output of the port pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
