lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>AFECON</name>
         <description>Unknown</description>
         <baseAddress>0x400C0400</baseAddress>
         <groupName>AFECON</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>ADIID</name>
               <addressOffset>0x00000000</addressOffset>
               <size>16</size>
               <description>ADI Identification</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADIID</name>
                     <description>ADI Identifier.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHIPID</name>
               <addressOffset>0x00000004</addressOffset>
               <size>16</size>
               <description>Chip Identification</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>Revision</name>
                     <description>Silicon Revision Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PartID</name>
                     <description>Part Identifier</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKCON0</name>
               <addressOffset>0x00000008</addressOffset>
               <size>16</size>
               <description>Clock Divider Configuration</description>
               <resetValue>0x00000441</resetValue>
               <fields>
                  <field>
                     <name>SYSCLKDIV</name>
                     <description>System Clock Divider Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000003F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ADCCLKDIV</name>
                     <description>ADC Clock Divider Configuration</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SFFTCLKDIVCNT</name>
                     <description>SFFT Clock Divider Configuration</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000003F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKEN1</name>
               <addressOffset>0x00000010</addressOffset>
               <size>16</size>
               <description>Clock Gate Enable</description>
               <resetValue>0x000002C0</resetValue>
               <fields>
                  <field>
                     <name>ACLKDIS</name>
                     <description>ACLK Clock Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>GPT0DIS</name>
                     <description>GPT0 Clock Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>GPT1DIS</name>
                     <description>GPT1 Clock Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKSEL</name>
               <addressOffset>0x00000014</addressOffset>
               <size>16</size>
               <description>Clock Select</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYSCLKSEL</name>
                     <description>Select System Clock Source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ADCCLKSEL</name>
                     <description>Select ADC Clock Source</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPIOCLKMUXSEL</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>16</size>
               <description>GPIO Clock MUX Select</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>Configure Clock MUX Out to GPIO</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKCON0KEY</name>
               <addressOffset>0x00000020</addressOffset>
               <size>16</size>
               <description>Enable Clock Division to 8Mhz,4Mhz and 2Mhz</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>divsysclk_ulp_en</name>
                     <description>Enable Clock Division to 8Mhz,4Mhz and 2Mhz</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIE2DIESTA</name>
               <addressOffset>0x00000028</addressOffset>
               <size>16</size>
               <description>DIE2DIESTA</description>
               <resetValue>0x0000ABCD</resetValue>
               <fields>
                  <field>
                     <name>STA</name>
                     <description>DIE2DIE Deadlock and Transaction Error Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>MKEY</name>
               <addressOffset>0x00000034</addressOffset>
               <size>16</size>
               <description>MKEY</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>Key to Unlock SWRSTCON</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSPUPDATEEN</name>
               <addressOffset>0x00000038</addressOffset>
               <size>16</size>
               <description>DSP Update Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DSPLOOP</name>
                     <description>ADC Digital Logic Test</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
