lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>AFEWDT</name>
         <description>Unknown</description>
         <baseAddress>0x400C0900</baseAddress>
         <groupName>AFEWDT</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>WDTLD</name>
               <addressOffset>0x00000000</addressOffset>
               <size>16</size>
               <description>Watchdog Timer Load Value</description>
               <resetValue>0x00001000</resetValue>
               <fields>
                  <field>
                     <name>LOAD</name>
                     <description>WDT Load Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDTVALS</name>
               <addressOffset>0x00000004</addressOffset>
               <size>16</size>
               <description>Current Count Value</description>
               <resetValue>0x00001000</resetValue>
               <fields>
                  <field>
                     <name>CCOUNT</name>
                     <description>Current WDT Count Value.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDTCON</name>
               <addressOffset>0x00000008</addressOffset>
               <size>16</size>
               <description>Watchdog Timer Control Register</description>
               <resetValue>0x000002E9</resetValue>
               <fields>
                  <field>
                     <name>PDSTOP</name>
                     <description>Power Down Stop Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Continue</name>
                           <description>Continue Counting When In Hibernate</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Stop</name>
                           <description>Stop Counter When In Hibernate.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQ</name>
                     <description>WDT Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Reset</name>
                           <description>Watchdog Timer timeout creates a reset.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Interrupt</name>
                           <description>Watchdog Timer  timeout creates an interrupt instead of reset.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRE</name>
                     <description>Prescaler.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Timer Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MDE</name>
                     <description>Timer Mode Select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>Reserved1_7</name>
                     <description>Reserved</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CLKDIV2</name>
                     <description>Clock Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MINLOAD_EN</name>
                     <description>Timer Window Control</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WDTIRQEN</name>
                     <description>WDT Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RESERVED_15_11</name>
                     <description>RESERVED</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDTCLRI</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>16</size>
               <description>Refresh Watchdog Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRWDG</name>
                     <description>Refresh Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDTSTA</name>
               <addressOffset>0x00000018</addressOffset>
               <size>16</size>
               <description>Timer Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>WDT Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Cleared</name>
                           <description>Watchdog Timer Interrupt Not Pending</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Pending</name>
                           <description>Watchdog Timer Interrupt Pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLRI</name>
                     <description>WDTCLRI Write Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TLD</name>
                     <description>WDTVAL Write Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Sync_Complete</name>
                           <description>Arm and AFE Watchdog Clock Domains WDTLD values match</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Sync_In_Progress</name>
                           <description>Synchronize In Progress</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CON</name>
                     <description>WDTCON Write Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>Lock Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Open</name>
                           <description>Timer Operation Not Locked</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Locked</name>
                           <description>Timer Enabled and Locked</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OTPWRDONE</name>
                     <description>Reset Type Status</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TMINLD</name>
                     <description>WDTMINLD Write Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RESERVED_15_7</name>
                     <description>RESERVED</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>9</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000001FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDTMINLD</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>16</size>
               <description>Minimum Load Value</description>
               <resetValue>0x00000800</resetValue>
               <fields>
                  <field>
                     <name>MIN_LOAD</name>
                     <description>WDT Min Load Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
