lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>ALLON</name>
         <description>Always On Register</description>
         <baseAddress>0x400C0A00</baseAddress>
         <groupName>ALLON</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PWRMOD</name>
               <addressOffset>0x00000000</addressOffset>
               <size>16</size>
               <description>Power Modes</description>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>PWRMOD</name>
                     <description>Power Mode Control Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWRKEY</name>
               <addressOffset>0x00000004</addressOffset>
               <size>16</size>
               <description>Key Protection for PWRMOD</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWRKEY</name>
                     <description>PWRMOD Key Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSCKEY</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>16</size>
               <description>Key Protection for OSCCON</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OSCKEY</name>
                     <description>Oscillator Control Key Register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSCCON</name>
               <addressOffset>0x00000010</addressOffset>
               <size>16</size>
               <description>Oscillator Control</description>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>LFOSCEN</name>
                     <description>Low Frequency Internal Oscillator Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HFOSCEN</name>
                     <description>High Frequency Internal Oscillator Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HFXTALEN</name>
                     <description>High Frequency Crystal Oscillator Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFOSCOK</name>
                     <description>Status of LFOSC Oscillator</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HFOSCOK</name>
                     <description>Status of HFOSC Oscillator</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HFXTALOK</name>
                     <description>Status of HFXTAL Oscillator</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>EI2CON</name>
               <addressOffset>0x00000028</addressOffset>
               <size>16</size>
               <description>External Interrupt Configuration 2</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BUSINTMDE</name>
                     <description>BUS Interrupt Detection Mode Registers</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BUSINTEN</name>
                     <description>BUS Interrupt Detection Enable Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>EICLR</name>
               <addressOffset>0x00000030</addressOffset>
               <size>16</size>
               <description>External Interrupt Clear</description>
               <resetValue>0x0000C000</resetValue>
               <fields>
                  <field>
                     <name>BUSINT</name>
                     <description>BUS Interrupt</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>AUTCLRBUSEN</name>
                     <description>Enable Auto Clear of Bus Interrupt</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSTSTA</name>
               <addressOffset>0x00000040</addressOffset>
               <size>16</size>
               <description>Reset Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>POR</name>
                     <description>Power-on Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EXTRST</name>
                     <description>External Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>WDRST</name>
                     <description>Watchdog Timeout</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MMRSWRST</name>
                     <description>MMR Software Reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMUSTA</name>
               <addressOffset>0x00000044</addressOffset>
               <size>16</size>
               <description>PMU Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PMUSTATE</name>
                     <description>PMU FSM States</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKEN0</name>
               <addressOffset>0x00000070</addressOffset>
               <size>16</size>
               <description>32KHz Peripheral Clock Enable</description>
               <resetValue>0x00000004</resetValue>
               <fields>
                  <field>
                     <name>WDTDIS</name>
                     <description>Watch Dog Timer Clock Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SLPWUTDIS</name>
                     <description>Sleep/Wakeup Timer Clock Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TIACHPDIS</name>
                     <description>TIA Chop Clock Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
