lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>AGPT1</name>
         <description>General Purpose Timer</description>
         <baseAddress>0x400C0E00</baseAddress>
         <groupName>AGPT1</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000040</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>AGPT1_EVT</name>
	    <value>65</value>
	    <description>AGPT1_EVT</description>
	 </interrupt>
         <registers>
            <register>
               <name>LD1</name>
               <addressOffset>0x00000000</addressOffset>
               <size>16</size>
               <description>16-bit Load Value Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LOAD</name>
                     <description>Load Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>VAL1</name>
               <addressOffset>0x00000004</addressOffset>
               <size>16</size>
               <description>16-bit Timer Value Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VAL</name>
                     <description>Current Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CON1</name>
               <addressOffset>0x00000008</addressOffset>
               <size>16</size>
               <description>Control Register</description>
               <resetValue>0x0000000A</resetValue>
               <fields>
                  <field>
                     <name>PRE</name>
                     <description>Prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>UP</name>
                     <description>Count up</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MOD</name>
                     <description>Timer Mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Timer Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CLK</name>
                     <description>Clock Select</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RLD</name>
                     <description>Reload Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EVENT</name>
                     <description>Event Select Range</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EVENTEN</name>
                     <description>Event Select</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RSTEN</name>
                     <description>Counter and Prescale Reset Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SYNCBYP</name>
                     <description>Synchronization Bypass</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLRI1</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>16</size>
               <description>Clear Interrupt Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TMOUT</name>
                     <description>Clear Timeout Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>CAP</name>
                     <description>Clear Captured Event Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAP1</name>
               <addressOffset>0x00000010</addressOffset>
               <size>16</size>
               <description>Capture Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CAP</name>
                     <description>16-bit Captured Value.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALD1</name>
               <addressOffset>0x00000014</addressOffset>
               <size>16</size>
               <description>16-bit Load Value, Asynchronous Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ALOAD</name>
                     <description>Load Value, Asynchronous</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>AVAL1</name>
               <addressOffset>0x00000018</addressOffset>
               <size>16</size>
               <description>16-bit Timer Value, Asynchronous Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AVAL</name>
                     <description>Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>STA1</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>16</size>
               <description>Status Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TMOUT</name>
                     <description>Timeout Event Occurred</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CAP</name>
                     <description>Capture Event Pending</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>Timer Busy</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PDOK</name>
                     <description>Clear Interrupt Register Synchronization</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RSTCNT</name>
                     <description>Counter Reset Occurring</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMCON1</name>
               <addressOffset>0x00000020</addressOffset>
               <size>16</size>
               <description>PWM Control Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MATCHEN</name>
                     <description>PWM Match Enabled.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IDLE</name>
                     <description>PWM Idle State.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWMMAT1</name>
               <addressOffset>0x00000024</addressOffset>
               <size>16</size>
               <description>PWM Match Value Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MATCHVAL</name>
                     <description>PWM Match Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTEN1</name>
               <addressOffset>0x00000028</addressOffset>
               <size>16</size>
               <description>Interrupt Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INTEN</name>
                     <description>Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
