lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>AFECRC</name>
         <description>CRC Accelerator</description>
         <baseAddress>0x400C1000</baseAddress>
         <groupName>AFECRC</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTL</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>CRC Control Register</description>
               <resetValue>0x10000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>CRC Peripheral Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSBFIRST</name>
                     <description>LSB First Calculation Order</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BITMIRR</name>
                     <description>Bit Mirroring.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BYTMIRR</name>
                     <description>Byte Mirroring.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>W16SWP</name>
                     <description>Word16 Swap Enabled.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MON_EN</name>
                     <description>Enable Apb32/Apb16 to Get Address/Data for CRC Calculation</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RevID</name>
                     <description>Revision ID</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPDATA</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Data Input.</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Data Input.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>RESULT</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>CRC Residue</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CRC Residue</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>POLY</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>CRC Reduction Polynomial</description>
               <resetValue>0x04C11DB7</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CRC Reduction Polynomial</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPBITS</name>
               <addressOffset>0x00000010</addressOffset>
               <size>8</size>
               <description>Input Data Bits</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA_BITS</name>
                     <description>Input Data Bits.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPBYTE</name>
               <addressOffset>0x00000014</addressOffset>
               <size>8</size>
               <description>Input Data Byte</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA_BYTE</name>
                     <description>Input Data Byte.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRC_SIG_COMP</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size>
               <description>CRC Signature Compare Data Input.</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRC_SIG</name>
                     <description>CRC Signature Compare Data Input.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCINTEN</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size>
               <description>CRC Error Interrupt Enable Bit</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRC_ERR_EN</name>
                     <description>CRC Error Interrupt Enable Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>reserved_31_1</name>
                     <description>Reserved</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x7FFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTSTA</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size>
               <description>CRC Error Interrupt Status Bit</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRC_ERR_ST</name>
                     <description>CRC Error Interrupt Status Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
