lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>AFE</name>
         <description>Unknown</description>
         <baseAddress>0x400C2000</baseAddress>
         <groupName>AFE</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000800</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>AFE_ERROR</name>
	    <value>47</value>
	    <description>AFE_ERROR</description>
	 </interrupt>
	 <interrupt>
	    <name>AFE_ADC</name>
	    <value>48</value>
	    <description>AFE_ADC</description>
	 </interrupt>
	 <interrupt>
	    <name>AFE_GEN</name>
	    <value>49</value>
	    <description>AFE_GEN</description>
	 </interrupt>
	 <interrupt>
	    <name>AFE_CMDFIFO</name>
	    <value>50</value>
	    <description>AFE_CMDFIFO</description>
	 </interrupt>
	 <interrupt>
	    <name>AFE_DATAFIFO</name>
	    <value>51</value>
	    <description>AFE_DATAFIFO</description>
	 </interrupt>
	 <interrupt>
	    <name>AFE_Watchdog</name>
	    <value>52</value>
	    <description>AFE_Watchdog</description>
	 </interrupt>
	 <interrupt>
	    <name>AFE_CRC</name>
	    <value>53</value>
	    <description>AFE_CRC</description>
	 </interrupt>
	 <interrupt>
	    <name>AFE_GPT0</name>
	    <value>54</value>
	    <description>AFE_GPT0</description>
	 </interrupt>
	 <interrupt>
	    <name>AFE_GPT1</name>
	    <value>55</value>
	    <description>AFE_GPT1</description>
	 </interrupt>
         <registers>
            <register>
               <name>AFECON</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>AFE Configuration</description>
               <resetValue>0x00080000</resetValue>
               <fields>
                  <field>
                     <name>HPREFDIS</name>
                     <description>Disable High Power Reference</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DACEN</name>
                     <description>High Power DAC Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Off</name>
                           <description>High Power DAC Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>On</name>
                           <description>High Power DAC Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADCEN</name>
                     <description>ADC Power Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ADCCONVEN</name>
                     <description>ADC Conversion Start Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EXBUFEN</name>
                     <description>Enable Excitation Buffer</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>INAMPEN</name>
                     <description>Enable Excitation Amplifier</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TIAEN</name>
                     <description>High Power TIA Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TEMPSENSEN0</name>
                     <description>ADC Temperature Sensor Channel Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TEMPCONVEN</name>
                     <description>ADC Temp Sensor Convert Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WAVEGENEN</name>
                     <description>Waveform Generator Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DFTEN</name>
                     <description>DFT Hardware Accelerator Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SINC2EN</name>
                     <description>ADC Output 50/60Hz Filter Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ALDOILIMITEN</name>
                     <description>Analog LDO Current Limiting Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DACREFEN</name>
                     <description>High Speed DAC Reference Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DACBUFEN</name>
                     <description>Enable DC DAC Buffer</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWCON</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>Switch Matrix Configuration</description>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>DMUXCON</name>
                     <description>Control of D Switch MUX</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PMUXCON</name>
                     <description>Control of P Switch MUX</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>NMUXCON</name>
                     <description>Control of N Switch MUX</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TMUXCON</name>
                     <description>Control of T Switch MUX.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SWSOURCESEL</name>
                     <description>Switch Control Select</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>T9CON</name>
                     <description>Control of T[9]</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>T10CON</name>
                     <description>Control of T[10]</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>T11CON</name>
                     <description>Control of T[11]</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSDACCON</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>High Speed DAC Configuration</description>
               <resetValue>0x0000001E</resetValue>
               <fields>
                  <field>
                     <name>ATTENEN</name>
                     <description>PGA Stage Gain Attenuation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RATE</name>
                     <description>DAC Update Rate</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>INAMPGNMDE</name>
                     <description>Excitation Amplifier Gain Control</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>WGCON</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <description>Waveform Generator Configuration</description>
               <resetValue>0x00000030</resetValue>
               <fields>
                  <field>
                     <name>TYPESEL</name>
                     <description>Selects the Type of Waveform</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DACOFFSETCAL</name>
                     <description>Bypass DAC Offset</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DACGAINCAL</name>
                     <description>Bypass DAC Gain</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>WGFCW</name>
               <addressOffset>0x00000030</addressOffset>
               <size>32</size>
               <description>Waveform Generator - Sinusoid Frequency Control Word</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SINEFCW</name>
                     <description>Sinusoid Generator Frequency Control Word</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>WGPHASE</name>
               <addressOffset>0x00000034</addressOffset>
               <size>32</size>
               <description>Waveform Generator - Sinusoid Phase Offset</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SINEOFFSET</name>
                     <description>Sinusoid Phase Offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>20</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000FFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>WGOFFSET</name>
               <addressOffset>0x00000038</addressOffset>
               <size>32</size>
               <description>Waveform Generator - Sinusoid Offset</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SINEOFFSET</name>
                     <description>Sinusoid Offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>WGAMPLITUDE</name>
               <addressOffset>0x0000003C</addressOffset>
               <size>32</size>
               <description>Waveform Generator - Sinusoid Amplitude</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SINEAMPLITUDE</name>
                     <description>Sinusoid Amplitude</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000007FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCFILTERCON</name>
               <addressOffset>0x00000044</addressOffset>
               <size>32</size>
               <description>ADC Output Filters Configuration</description>
               <resetValue>0x00000301</resetValue>
               <fields>
                  <field>
                     <name>ADCCLK</name>
                     <description>ADC Data Rate</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LPFBYPEN</name>
                     <description>50/60Hz Low Pass Filter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SINC3BYP</name>
                     <description>SINC3 Filter Bypass</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>AVRGEN</name>
                     <description>Average Function Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SINC2OSR</name>
                     <description>SINC2 OSR</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SINC3OSR</name>
                     <description>SINC3 OSR</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>AVRGNUM</name>
                     <description>Number of Samples Averaged</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SINC2CLKENB</name>
                     <description>SINC2 Filter Clock Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DACWAVECLKENB</name>
                     <description>DAC Wave Clock Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DFTCLKENB</name>
                     <description>DFT Clock Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSDACDAT</name>
               <addressOffset>0x00000048</addressOffset>
               <size>32</size>
               <description>HS DAC Code</description>
               <resetValue>0x00000800</resetValue>
               <fields>
                  <field>
                     <name>DACDAT</name>
                     <description>DAC Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPREFBUFCON</name>
               <addressOffset>0x00000050</addressOffset>
               <size>32</size>
               <description>LPREF_BUF_CON</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LPREFDIS</name>
                     <description>Set This Bit Will Power Down Low Power Bandgap</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LPBUF2P5DIS</name>
                     <description>Low Power Bandgap&#39;s Output Buffer</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BOOSTCURRENT</name>
                     <description>Set: Drive 2 Dac ;Unset Drive 1 Dac, and Save Power</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCDAT</name>
               <addressOffset>0x00000074</addressOffset>
               <size>32</size>
               <description>ADC Raw Result</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>ADC Result</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFTREAL</name>
               <addressOffset>0x00000078</addressOffset>
               <size>32</size>
               <description>DFT Result, Real Part</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DFT Real</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0003FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
