lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
            <register>
               <name>DFTIMAG</name>
               <addressOffset>0x0000007C</addressOffset>
               <size>32</size>
               <description>DFT Result, Imaginary Part</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DFT Imaginary</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>18</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0003FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SINC2DAT</name>
               <addressOffset>0x00000080</addressOffset>
               <size>32</size>
               <description>Supply Rejection Filter Result</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>LPF Result</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>TEMPSENSDAT</name>
               <addressOffset>0x00000084</addressOffset>
               <size>32</size>
               <description>Temperature Sensor Result</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Temp Sensor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCINTIEN</name>
               <addressOffset>0x00000088</addressOffset>
               <size>32</size>
               <description>ADC Interrupt Enable Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADCRDYIEN</name>
                     <description>ADCDAT Ready Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DFTRDYIEN</name>
                     <description>DFT Result Ready Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SINC2RDYIEN</name>
                     <description>Low Pass Filter Result Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TEMPRDYIEN</name>
                     <description>Temp Sensor Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ADCMINFAILIEN</name>
                     <description>ADCMIN Interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ADCMAXFAILIEN</name>
                     <description>ADCMAX Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ADCDELTAFAILIEN</name>
                     <description>Delta Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MEANIEN</name>
                     <description>Mean Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VARIEN</name>
                     <description>Variance Interrupt</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCINTSTA</name>
               <addressOffset>0x00000098</addressOffset>
               <size>32</size>
               <description>ADC Interrupt Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADCRDY</name>
                     <description>ADC Result Ready Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DFTRDY</name>
                     <description>DFT Result Ready Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SINC2RDY</name>
                     <description>Low Pass Filter Result Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TEMPRDY</name>
                     <description>Temp Sensor Result Ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ADCMINERR</name>
                     <description>ADC Minimum Value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ADCMAXERR</name>
                     <description>ADC Maximum Value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ADCDIFFERR</name>
                     <description>ADC Delta Ready</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MEANRDY</name>
                     <description>Mean Result Ready</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VARRDY</name>
                     <description>Variance Result Ready</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFEGENINTSTA</name>
               <addressOffset>0x0000009C</addressOffset>
               <size>32</size>
               <description>Analog Generation Interrupt</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CUSTOMIRQ0</name>
                     <description>Custom IRQ 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CUSTOMIRQ1</name>
                     <description>Custom IRQ 1.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CUSTOMIRQ2</name>
                     <description>Custom IRQ 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CUSTOMIRQ3</name>
                     <description>Custom IRQ 3.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCMIN</name>
               <addressOffset>0x000000A8</addressOffset>
               <size>32</size>
               <description>ADC Minimum Value Check</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MINVAL</name>
                     <description>ADC Minimum Value Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCMINSM</name>
               <addressOffset>0x000000AC</addressOffset>
               <size>32</size>
               <description>ADCMIN Hysteresis Value</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MINCLRVAL</name>
                     <description>ADCMIN Hysteresis Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCMAX</name>
               <addressOffset>0x000000B0</addressOffset>
               <size>32</size>
               <description>ADC Maximum Value Check</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MAXVAL</name>
                     <description>ADC Max Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCMAXSMEN</name>
               <addressOffset>0x000000B4</addressOffset>
               <size>32</size>
               <description>ADCMAX Hysteresis Value</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MAXSWEN</name>
                     <description>ADCMAX Hysteresis Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCDELTA</name>
               <addressOffset>0x000000B8</addressOffset>
               <size>32</size>
               <description>ADC Delta Value</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DELTAVAL</name>
                     <description>ADCDAT Code Differences Limit Option</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>HPOSCCON</name>
               <addressOffset>0x000000BC</addressOffset>
               <size>32</size>
               <description>HPOSC Configuration</description>
               <resetValue>0x00000024</resetValue>
               <fields>
                  <field>
                     <name>CLK32MHZEN</name>
                     <description>16M/32M Output Selector Signal.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFTCON</name>
               <addressOffset>0x000000D0</addressOffset>
               <size>32</size>
               <description>AFE DSP Configuration</description>
               <resetValue>0x00000090</resetValue>
               <fields>
                  <field>
                     <name>HANNINGEN</name>
                     <description>Hanning Window Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DFTNUM</name>
                     <description>ADC Samples Used</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DFTINSEL</name>
                     <description>DFT Input Select</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPTIASW1</name>
               <addressOffset>0x000000E0</addressOffset>
               <size>32</size>
               <description>ULPTIA Switch Configuration for Channel 1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIASWCON</name>
                     <description>TIA SW[11:0] Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CAPA_LP</name>
                           <description>CAPA test with LP TIA</description>
                           <value>20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NORM</name>
                           <description>Normal work mode</description>
                           <value>44</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIO</name>
                           <description>Normal work mode with back-back diode enabled.</description>
                           <value>45</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHORTSW</name>
                           <description>Work mode with short switch protection</description>
                           <value>46</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOWNOISE</name>
                           <description>Work mode, vzero-vbias=0.</description>
                           <value>108</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PABIASSEL</name>
                     <description>TIA SW12 Control. Active High</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TIABIASSEL</name>
                     <description>TIA SW13 Control. Active High</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPTIASW0</name>
               <addressOffset>0x000000E4</addressOffset>
               <size>32</size>
               <description>ULPTIA Switch Configuration for Channel 0</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIASWCON</name>
                     <description>TIA SW[11:0] Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>11</name>
                           <description>CAPA test with LP TIA</description>
                           <value>20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NORM</name>
                           <description>Normal work mode</description>
                           <value>44</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIO</name>
                           <description>Normal work mode with back-back diode enabled.</description>
                           <value>45</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHORTSW</name>
                           <description>Work mode with short switch protection</description>
                           <value>46</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOWNOISE</name>
                           <description>Work mode, vzero-vbias=0.</description>
                           <value>108</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PABIASSEL</name>
                     <description>TIA SW12 Control. Active High</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TIABIASSEL</name>
                     <description>TIA SW13 Control. Active High</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VZEROSHARE</name>
                     <description>TIA SW14 Control. Active High</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RECAL</name>
                     <description>TIA SW15 Control. Active High</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
