lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
            <register>
               <name>LPTIACON1</name>
               <addressOffset>0x000000E8</addressOffset>
               <size>32</size>
               <description>ULPTIA Control Bits Channel 1</description>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>TIAPDEN</name>
                     <description>TIA Power Down</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PAPDEN</name>
                     <description>PA Power Down</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HALFPWR</name>
                     <description>Half Power Mode Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IBOOST</name>
                     <description>Current Boost Control</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TIAGAIN</name>
                     <description>Set RTIA Gain Resistor</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISCONTIA</name>
                           <description>Disconnect TIA Gain resistor</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN200</name>
                           <description>200 Ohm</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN1k</name>
                           <description>1k ohm</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN2k</name>
                           <description>2k</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN3k</name>
                           <description>3k</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN4k</name>
                           <description>4k</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN6k</name>
                           <description>6k</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN8k</name>
                           <description>8k</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN10k</name>
                           <description>10k</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN12k</name>
                           <description>12k</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN16k</name>
                           <description>16k</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN20k</name>
                           <description>20k</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN24k</name>
                           <description>24k</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN30k</name>
                           <description>30k</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN32k</name>
                           <description>32k</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN40k</name>
                           <description>40k</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN48k</name>
                           <description>48k</description>
                           <value>16</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN64k</name>
                           <description>64k</description>
                           <value>17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN85k</name>
                           <description>85k</description>
                           <value>18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN96k</name>
                           <description>96k</description>
                           <value>19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN100k</name>
                           <description>100k</description>
                           <value>20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN120k</name>
                           <description>120k</description>
                           <value>21</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN128k</name>
                           <description>128k</description>
                           <value>22</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN160k</name>
                           <description>160k</description>
                           <value>23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN196k</name>
                           <description>196k</description>
                           <value>24</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN256k</name>
                           <description>256k</description>
                           <value>25</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TIAGAIN512k</name>
                           <description>512k</description>
                           <value>26</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TIARL</name>
                     <description>Set RLOAD</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RL0</name>
                           <description>0 ohm</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RL10</name>
                           <description>10 ohm</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RL30</name>
                           <description>30 ohm</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RL50</name>
                           <description>50 ohm</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RL100</name>
                           <description>100 ohm</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RL1p6k</name>
                           <description>1.6kohm</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RL3p1k</name>
                           <description>3.1kohm</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RL3p5k</name>
                           <description>3.6kohm</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TIARF</name>
                     <description>Set LPF Resistor</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISCONRF</name>
                           <description>Disconnect TIA output from LPF pin</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BYPRF</name>
                           <description>Bypass resistor</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RF20k</name>
                           <description>20k Ohm</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RF100k</name>
                           <description>100k Ohm</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RF200k</name>
                           <description>200k Ohm</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RF400k</name>
                           <description>400k Ohm</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RF600k</name>
                           <description>600k Ohm</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RF1MOHM</name>
                           <description>1Meg Ohm</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHOPEN</name>
                     <description>Chopping Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
