lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
            <register>
               <name>LPDACCON0</name>
               <addressOffset>0x00000128</addressOffset>
               <size>32</size>
               <description>LPDAC Control Bits</description>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>RSTEN</name>
                     <description>Enable Writes to ULPDAC0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>WRITEDIS</name>
                           <description>Disable ULPDAC0 Writes</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRITEEN</name>
                           <description>Enable ULPDAC0 Writes</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWDEN</name>
                     <description>LPDAC0 Power Down</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PWREN</name>
                           <description>ULPDAC0 Powered On</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWRDIS</name>
                           <description>ULPDAC0 Powered Off</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>REFSEL</name>
                     <description>Reference Select Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ULPREF</name>
                           <description>ULP2P5V Ref</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AVDD</name>
                           <description>AVDD Reference</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VBIASMUX</name>
                     <description>VBIAS MUX Select</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>12BIT</name>
                           <description>Output 12Bit</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>output 6Bit</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VZEROMUX</name>
                     <description>VZERO MUX Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>BITS6</name>
                           <description>VZERO 6BIT</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BITS12</name>
                           <description>VZERO 12BIT</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DACMDE</name>
                     <description>LPDAC0 Switch Settings</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NORM</name>
                           <description>ULPDAC0 switches set for normal mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIAG</name>
                           <description>ULPDAC0 switches set for Diagnostic mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WAVETYPE</name>
                     <description>LPDAC Data Source</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>MMR</name>
                           <description>Direct from ULPDACDAT0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WAVEGEN</name>
                           <description>Waveform generator</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPDACDAT1</name>
               <addressOffset>0x0000012C</addressOffset>
               <size>32</size>
               <description>Low Power DAC1 data register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DACIN12</name>
                     <description>12BITVAL, 1LSB=537uV</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DACIN6</name>
                     <description>6BITVAL, 1LSB=34.375mV</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPDACSW1</name>
               <addressOffset>0x00000130</addressOffset>
               <size>32</size>
               <description>Control register for switches to LPDAC1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LPDACSW</name>
                     <description>ULPDAC0 Switches Matrix</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>LPMODEDIS</name>
                     <description>Switch Control</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DACCONBIT5</name>
                           <description>ULPDAC Switch controlled by ULPDACCON1 bit 5</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OVRRIDE</name>
                           <description>ULPDAC Switches override</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPDACCON1</name>
               <addressOffset>0x00000134</addressOffset>
               <size>32</size>
               <description>ULP_DACCON1</description>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>RSTEN</name>
                     <description>Enable Writes to ULPDAC1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>WRITEDIS</name>
                           <description>Disable ULPDAC1 Writes</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRITEEN</name>
                           <description>Enable ULPDAC1 Writes</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWDEN</name>
                     <description>ULPDAC0 Power</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PWREN</name>
                           <description>ULPDAC1 Powered On</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PWRDIS</name>
                           <description>ULPDAC1 Powered Off</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>REFSEL</name>
                     <description>REFSEL</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ULPREF</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AVDD</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VBIASMUX</name>
                     <description>BITSEL</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>12BIT Output</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>6BIT Output</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VZEROMUX</name>
                     <description>VZEROOUT</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>BITS6</name>
                           <description>VZERO 6BIT</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BITS12</name>
                           <description>VZERO 12BIT</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DACMDE</name>
                     <description>LPDAC1 Switch Settings</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NORM</name>
                           <description>ULPDAC1 switches set for normal mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIAG</name>
                           <description>ULPDAC1 switches set for Diagnostic mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WAVETYPE</name>
                     <description>DAC Input Source</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSWFULLCON</name>
               <addressOffset>0x00000150</addressOffset>
               <size>32</size>
               <description>Switch Matrix Full Configuration (D)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DR0</name>
                     <description>Control of Dr0 Switch.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>D2</name>
                     <description>Control of D2 Switch.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>D3</name>
                     <description>Control of D3 Switch.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>D4</name>
                     <description>Control of D4 Switch.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>D5</name>
                     <description>Control of D5 Switch.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>D6</name>
                     <description>Control of D6 Switch.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>D7</name>
                     <description>Control of D7 Switch.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>D8</name>
                     <description>Control of D8 Switch.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>NSWFULLCON</name>
               <addressOffset>0x00000154</addressOffset>
               <size>32</size>
               <description>Switch Matrix Full Configuration (N)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>N1</name>
                     <description>Control of N1 Switch. Set Will Close N1, Unset Open</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>N2</name>
                     <description>Control of N2 Switch. Set Will Close N2, Unset Open</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>N3</name>
                     <description>Control of N3 Switch. Set Will Close N3, Unset Open</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>N4</name>
                     <description>Control of N4 Switch. Set Will Close N4, Unset Open</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>N5</name>
                     <description>Control of N5 Switch. Set Will Close N5, Unset Open</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>N6</name>
                     <description>Control of N6 Switch. Set Will Close N6, Unset Open</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>N7</name>
                     <description>Control of N7 Switch. Set Will Close N7, Unset Open</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>N8</name>
                     <description>Control of N8 Switch. Set Will Close N8, Unset Open</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>N9</name>
                     <description>Control of N9 Switch. Set Will Close N9, Unset Open</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>NR1</name>
                     <description>Control of Nr1 Switch. Set Will Close Nr1, Unset Open</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>Nl</name>
                     <description>Control of NL Switch.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>NL2</name>
                     <description>Control of NL2 Switch.</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
