lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
            <register>
               <name>PSWFULLCON</name>
               <addressOffset>0x00000158</addressOffset>
               <size>32</size>
               <description>Switch Matrix Full Configuration (P)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PR0</name>
                     <description>PR0 Switch Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>P2</name>
                     <description>Control of P2 Switch. Set Will Close P2, Unset Open</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>P3</name>
                     <description>Control of P3 Switch. Set Will Close P3, Unset Open</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>P4</name>
                     <description>Control of P4 Switch. Set Will Close P4, Unset Open</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>P5</name>
                     <description>Control of P5 Switch. Set Will Close P5, Unset Open</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>P6</name>
                     <description>Control of P6 Switch. Set Will Close P6, Unset Open</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>P7</name>
                     <description>Control of P7 Switch. Set Will Close P7, Unset Open</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>P8</name>
                     <description>Control of P8 Switch. Set Will Close P8, Unset Open</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>P9</name>
                     <description>Control of P9 Switch. Set Will Close P9, Unset Open</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>P10</name>
                     <description>P10 Switch Control</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>P11</name>
                     <description>Control of P11 Switch. Set Will Close P11, Unset Open</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>P12</name>
                     <description>Control of P12 Switch. Set Will Close P12, Unset Open</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PL</name>
                     <description>PL Switch Control</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PL2</name>
                     <description>PL2 Switch Control</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSWFULLCON</name>
               <addressOffset>0x0000015C</addressOffset>
               <size>32</size>
               <description>Switch Matrix Full Configuration (T)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>T1</name>
                     <description>Control of T1 Switch. Set Will Close T1, Unset Open</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>T2</name>
                     <description>Control of T2 Switch. Set Will Close T2, Unset Open</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>T3</name>
                     <description>Control of T3 Switch. Set Will Close T3, Unset Open</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>T4</name>
                     <description>Control of T4 Switch. Set Will Close T4, Unset Open</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>T5</name>
                     <description>Control of T5 Switch. Set Will Close T5, Unset Open</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>T7</name>
                     <description>Control of T7 Switch. Set Will Close T7, Unset Open</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>T9</name>
                     <description>Control of T9 Switch. Set Will Close T9, Unset Open</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>T10</name>
                     <description>Control of T10 Switch. Set Will Close T10, Unset Open</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>T11</name>
                     <description>Control of T11 Switch. Set Will Close T11, Unset Open</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TR1</name>
                     <description>Control of Tr1 Switch. Set Will Close Tr1, Unset Open</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>TEMPCON0</name>
               <addressOffset>0x00000174</addressOffset>
               <size>32</size>
               <description>Temp Sensor Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Unused</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CHOPCON</name>
                     <description>Temp Sensor Chop Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable chop</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>Enable chop</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHOPFRESEL</name>
                     <description>Chop Mode Frequency Setting</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>BUFSENCON</name>
               <addressOffset>0x00000180</addressOffset>
               <size>32</size>
               <description>HP and LP Buffer Control</description>
               <resetValue>0x00000037</resetValue>
               <fields>
                  <field>
                     <name>V1P8HPADCEN</name>
                     <description>HP 1.8V Reference Buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>HPBUF_DIS</name>
                           <description>Disable 1.8V HP ADC Reference Buffer</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HPBUF_EN</name>
                           <description>Enable 1.8V HP ADC Reference Buffer</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>V1P8HPADCILIMITEN</name>
                     <description>HP ADC Input Current Limit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Limit_Dis</name>
                           <description>Disable buffer Current Limit</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Limit_En</name>
                           <description>Enable buffer Current Limit</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>V1P8LPADCEN</name>
                     <description>ADC 1.8V LP Reference Buffer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>LPADCREF_DIS</name>
                           <description>Disable LP 1.8V Reference Buffer</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPADCREF_EN</name>
                           <description>Enable LP 1.8V Reference Buffer</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>V1P8HPADCCHGDIS</name>
                     <description>Controls Decoupling Cap Discharge Switch</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Open</name>
                           <description>Open switch</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Closed</name>
                           <description>Close Switch</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>V1P1HPADCEN</name>
                     <description>Enable 1.1V HP CM Buffer</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Off</name>
                           <description>Disable 1.1V HP Common Mode Buffer</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>On</name>
                           <description>Enable 1.1V HP Common Mode Buffer</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>V1P1LPADCEN</name>
                     <description>ADC 1.1V LP Buffer</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Disable</name>
                           <description>Disable ADC 1.8V LP Reference Buffer</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Enable</name>
                           <description>Enable ADC 1.8V LP Reference Buffer</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>V1P1LPADCCHGDIS</name>
                     <description>Controls Decoupling Cap Discharge Switch</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>EnChrg</name>
                           <description>Open switch</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DisChrg</name>
                           <description>Close Switch</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>V1P8THERMSTEN</name>
                     <description>Buffered Reference Output</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable 1.8V Buffered Reference output</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>Enable 1.8V Buffered Reference output</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCCON</name>
               <addressOffset>0x000001A8</addressOffset>
               <size>32</size>
               <description>ADC Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MUXSELP</name>
                     <description>Select Positive Input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MUXSELN</name>
                     <description>Select Negative Input</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>GNOFFSEL</name>
                     <description>Obsolete</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000003</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>GNOFSELPGA</name>
                     <description>Internal Offset/Gain Cancellation</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>GNPGA</name>
                     <description>PGA Gain Setup</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSWSTA</name>
               <addressOffset>0x000001B0</addressOffset>
               <size>32</size>
               <description>Switch Matrix Status (D)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>D1STA</name>
                     <description>Status of Dr0 Switch.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>D2STA</name>
                     <description>Status of D2 Switch.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>D3STA</name>
                     <description>Status of D3 Switch.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>D4STA</name>
                     <description>Status of D4 Switch.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>D5STA</name>
                     <description>Status of D5 Switch.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>D6STA</name>
                     <description>Status of D6 Switch.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>D7STA</name>
                     <description>Status of D7 Switch.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>D8STA</name>
                     <description>Status of D8 Switch.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
