lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
            <register>
               <name>PSWSTA</name>
               <addressOffset>0x000001B4</addressOffset>
               <size>32</size>
               <description>Switch Matrix Status (P)</description>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>PR0STA</name>
                     <description>PR0 Switch Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>P2STA</name>
                     <description>Status of P2 Switch.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>P3STA</name>
                     <description>Status of P3 Switch.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>P4STA</name>
                     <description>Status of P4 Switch.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>P5STA</name>
                     <description>Status of P5 Switch.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>P6STA</name>
                     <description>Status of P6 Switch.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>P7STA</name>
                     <description>Status of P7 Switch.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>P8STA</name>
                     <description>Status of P8 Switch.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>P9STA</name>
                     <description>Status of P9 Switch.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>P10STA</name>
                     <description>Status of P10 Switch.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>P11STA</name>
                     <description>Status of P11 Switch.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>P12STA</name>
                     <description>Status of P12 Switch.</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>P13STA</name>
                     <description>Status of P13 Switch.</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PLSTA</name>
                     <description>PL Switch Control</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PL2STA</name>
                     <description>PL Switch Control</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>NSWSTA</name>
               <addressOffset>0x000001B8</addressOffset>
               <size>32</size>
               <description>Switch Matrix Status (N)</description>
               <resetValue>0x00000C00</resetValue>
               <fields>
                  <field>
                     <name>N1STA</name>
                     <description>Status of N1 Switch.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>N2STA</name>
                     <description>Status of N2 Switch.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>N3STA</name>
                     <description>Status of N3 Switch.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>N4STA</name>
                     <description>Status of N4 Switch.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>N5STA</name>
                     <description>Status of N5 Switch.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>N6STA</name>
                     <description>Status of N6 Switch.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>N7STA</name>
                     <description>Status of N7 Switch.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>N8STA</name>
                     <description>Status of N8 Switch.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>N9STA</name>
                     <description>Status of N9 Switch.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NR1STA</name>
                     <description>Status of NR1 Switch.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NLSTA</name>
                     <description>Status of NL Switch.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NL2STA</name>
                     <description>Status of NL2 Switch.</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSWSTA</name>
               <addressOffset>0x000001BC</addressOffset>
               <size>32</size>
               <description>Switch Matrix Status (T)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>T1STA</name>
                     <description>Status of T1 Switch.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>T2STA</name>
                     <description>Status of T2 Switch.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>T3STA</name>
                     <description>Status of T3 Switch.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>T4STA</name>
                     <description>Status of T4 Switch.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>T5STA</name>
                     <description>Status of T5 Switch.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>T6STA</name>
                     <description>Status of T6 Switch.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>T7STA</name>
                     <description>Status of T7 Switch.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>T8STA</name>
                     <description>Status of T8 Switch.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>T9STA</name>
                     <description>Status of T9 Switch.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>T10STA</name>
                     <description>Status of T10 Switch.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>T11STA</name>
                     <description>Status of T11 Switch.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TR1STA</name>
                     <description>Status of TR1 Switch.</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATSVAR</name>
               <addressOffset>0x000001C0</addressOffset>
               <size>32</size>
               <description>Variance Output</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VARIANCE</name>
                     <description>Statistical Variance Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATSCON</name>
               <addressOffset>0x000001C4</addressOffset>
               <size>32</size>
               <description>Statistics Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STATSEN</name>
                     <description>Statistics Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable Statistics</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>Enable Statistics</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RESRVED</name>
                     <description>Reserved</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SAMPLENUM</name>
                     <description>Sample Size</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>STDDEV</name>
                     <description>Standard Deviation Configuration</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATSMEAN</name>
               <addressOffset>0x000001C8</addressOffset>
               <size>32</size>
               <description>Statistics Mean Output</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MEAN</name>
                     <description>Mean Output</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>REPEATADCCNV</name>
               <addressOffset>0x000001F0</addressOffset>
               <size>32</size>
               <description>REPEAT ADC Conversions</description>
               <resetValue>0x00000160</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>Enable Repeat ADC Conversions</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Dis</name>
                           <description>Disable Repeat ADC Conversions</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>En</name>
                           <description>Enable Repeat ADC Conversions</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NUM</name>
                     <description>Repeat Value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALDATLOCK</name>
               <addressOffset>0x00000230</addressOffset>
               <size>32</size>
               <description>Calibration Data Lock</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>Password for Calibration Data Registers</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFFSETHSTIA</name>
               <addressOffset>0x00000234</addressOffset>
               <size>32</size>
               <description>ADC Offset Calibration High Speed TIA Channel</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>HPTIA Offset Calibration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCGAINTEMPSENS0</name>
               <addressOffset>0x00000238</addressOffset>
               <size>32</size>
               <description>ADC Gain Calibration Temp Sensor Channel</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Gain Calibration Temp Sensor Channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFFSETTEMPSENS0</name>
               <addressOffset>0x0000023C</addressOffset>
               <size>32</size>
               <description>ADC Offset Calibration Temp Sensor Channel 0</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Offset Calibration Temp Sensor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCGAINGN1</name>
               <addressOffset>0x00000240</addressOffset>
               <size>32</size>
               <description>ADCPGAGN1: ADC Gain Calibration Auxiliary Input Channel</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Gain Calibration PGA Gain 1x</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFFSETGN1</name>
               <addressOffset>0x00000244</addressOffset>
               <size>32</size>
               <description>ADC Offset Calibration Auxiliary Channel (PGA Gain=1)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Offset Calibration Gain1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DACGAIN</name>
               <addressOffset>0x00000260</addressOffset>
               <size>32</size>
               <description>DACGAIN</description>
               <resetValue>0x00000800</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>HS DAC Gain Correction Factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DACOFFSETATTEN</name>
               <addressOffset>0x00000264</addressOffset>
               <size>32</size>
               <description>DAC Offset with Attenuator Enabled (LP Mode)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>DAC Offset Correction Factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
