lkolbly/cmsis-svd/data/ADI/ADuCM355.svd
            <register>
               <name>DACOFFSET</name>
               <addressOffset>0x00000268</addressOffset>
               <size>32</size>
               <description>DAC Offset with Attenuator Disabled (LP Mode)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>DAC Offset Correction Factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCGAINGN1P5</name>
               <addressOffset>0x00000270</addressOffset>
               <size>32</size>
               <description>ADC Gain Calibration Auxiliary Input Channel (PGA Gain=1.5)</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Gain Calibration PGA Gain 1.5x</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCGAINGN2</name>
               <addressOffset>0x00000274</addressOffset>
               <size>32</size>
               <description>ADC Gain Calibration Auxiliary Input Channel (PGA Gain=2)</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Gain Calibration PGA Gain 2x</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCGAINGN4</name>
               <addressOffset>0x00000278</addressOffset>
               <size>32</size>
               <description>ADC Gain Calibration Auxiliary Input Channel (PGA Gain=4)</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Gain Calibration PGA Gain 4x</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCPGAOFFSETCANCEL</name>
               <addressOffset>0x00000280</addressOffset>
               <size>32</size>
               <description>ADC Offset Cancellation (Optional)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OFFSETCANCEL</name>
                     <description>Offset Cancellation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCGNHSTIA</name>
               <addressOffset>0x00000284</addressOffset>
               <size>32</size>
               <description>ADC Gain Calibration for HS TIA Channel</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Gain Error Calibration HS TIA Channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFFSETLPTIA0</name>
               <addressOffset>0x00000288</addressOffset>
               <size>32</size>
               <description>ADC Offset Calibration ULP-TIA0 Channel</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Offset Calibration for ULP-TIA0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCGNLPTIA0</name>
               <addressOffset>0x0000028C</addressOffset>
               <size>32</size>
               <description>ADC GAIN Calibration for LP TIA0 Channel</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Gain Error Calibration ULPTIA0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCPGAGN4OFCAL</name>
               <addressOffset>0x00000294</addressOffset>
               <size>32</size>
               <description>ADC Gain Calibration with DC Cancellation(PGA G=4)</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>ADCGAINAUX</name>
                     <description>DC Calibration Gain=4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00007FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCGAINGN9</name>
               <addressOffset>0x00000298</addressOffset>
               <size>32</size>
               <description>ADC Gain Calibration Auxiliary Input Channel (PGA Gain=9)</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Gain Calibration PGA Gain 9x</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFFSETEMPSENS1</name>
               <addressOffset>0x000002A8</addressOffset>
               <size>32</size>
               <description>ADC Offset Calibration  Temp Sensor Channel 1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Offset Calibration Temp Sensor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCGAINTEMPSENS1</name>
               <addressOffset>0x000002AC</addressOffset>
               <size>32</size>
               <description>ADC Gain Calibration Temperature Sensor Channel</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Gain Calibration for Diode Temp Sensor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DACOFFSETATTENHP</name>
               <addressOffset>0x000002B8</addressOffset>
               <size>32</size>
               <description>DAC Offset with Attenuator Enabled (HP Mode)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>DAC Offset Correction Factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DACOFFSETHP</name>
               <addressOffset>0x000002BC</addressOffset>
               <size>32</size>
               <description>DAC Offset with Attenuator Disabled (HP Mode)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>DAC Offset Correction Factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFFSETLPTIA1</name>
               <addressOffset>0x000002C0</addressOffset>
               <size>32</size>
               <description>ADC Offset Calibration LP TIA1 Channel</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Offset Calibration for ULP-TIA1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCGNLPTIA1</name>
               <addressOffset>0x000002C4</addressOffset>
               <size>32</size>
               <description>ADC GAIN Calibration for LP TIA1 Channel</description>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>ULPTIA1GN</name>
                     <description>Gain Calibration ULP-TIA1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFFSETGN2</name>
               <addressOffset>0x000002C8</addressOffset>
               <size>32</size>
               <description>Offset Calibration Auxiliary Channel (PGA Gain =2)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Offset Calibration Auxiliary Channel (PGA Gain =2)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFFSETGN1P5</name>
               <addressOffset>0x000002CC</addressOffset>
               <size>32</size>
               <description>Offset Calibration Auxiliary Channel (PGA Gain =1.5)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Offset Calibration Gain1.5</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFFSETGN9</name>
               <addressOffset>0x000002D0</addressOffset>
               <size>32</size>
               <description>Offset Calibration Auxiliary Channel (PGA Gain =9)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Offset Calibration Gain9</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOFFSETGN4</name>
               <addressOffset>0x000002D4</addressOffset>
               <size>32</size>
               <description>Offset Calibration Auxiliary Channel (PGA Gain =4)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Offset Calibration Gain4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMBW</name>
               <addressOffset>0x000002F0</addressOffset>
               <size>32</size>
               <description>Power Mode Configuration</description>
               <resetValue>0x00088800</resetValue>
               <fields>
                  <field>
                     <name>SYSHP</name>
                     <description>Set High Speed DAC and ADC in High Power Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>LP</name>
                           <description>LP mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HP</name>
                           <description>HP mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SYSBW</name>
                     <description>Configure System Bandwidth</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>BWNA</name>
                           <description>no action for system configuration</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BW50</name>
                           <description>50kHz -3dB bandwidth</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BW100</name>
                           <description>100kHz -3dB bandwidth</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BW250</name>
                           <description>250kHz -3dB bandwidth</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWMUX</name>
               <addressOffset>0x0000035C</addressOffset>
               <size>32</size>
               <description>Switch Mux for ECG</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWMUX</name>
                     <description>ECG Swmux Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CMMUX</name>
                     <description>CM Resistor Select for Ain2, Ain3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>TEMPCON1</name>
               <addressOffset>0x00000374</addressOffset>
               <size>32</size>
               <description>AFE_TEMPSEN_DIO</description>
               <resetValue>0x00020000</resetValue>
               <fields>
                  <field>
                     <name>ISWCON</name>
                     <description>Bias Current Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Test Signal Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>On</name>
                           <description>Turn On</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Off</name>
                           <description>Turn Off</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PWD</name>
                     <description>Power Down Control</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Active</name>
                           <description>Unknown</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PowerDown</name>
                           <description>Unknown</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TESTDAC</name>
               <addressOffset>0x00000388</addressOffset>
               <size>32</size>
               <description>DAC Test</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LPFBYPEN</name>
                     <description>Bypass Low Pass Filter Between Dac and Buffer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCBUFCON</name>
               <addressOffset>0x0000038C</addressOffset>
               <size>32</size>
               <description>Configure ADC Input Buffer</description>
               <resetValue>0x005F3D00</resetValue>
               <fields>
                  <field>
                     <name>CHOPDIS</name>
                     <description>Disable Chop</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>AMPDIS</name>
                     <description>Disable OpAmp.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
